ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define REF_CLK_SEL                           (0x0003)
#define REF_CAL_START                         (0x0004)
#define EXT_CNT_EN_SEL                        (0x0008)



#define CLK_REF_CNT_REG                      (0x50001602) /* Count value for oscillator calibration */
#define CLK_REF_CNT_REG_RESET                (0x00000000)

/*=============================*/
struct __CLK_REF_CNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REF_CNT_VAL                       : 16;
};
#define REF_CNT_VAL                           (0xFFFF)



#define CLK_REF_VAL_L_REG                    (0x50001604) /* XTAL32M reference cycles, lower 16 bits */
#define CLK_REF_VAL_L_REG_RESET              (0x00000000)

/*=============================*/
struct __CLK_REF_VAL_L_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL_CNT_VAL                      : 16;
};
#define XTAL_CNT_VAL                          (0xFFFF)



#define CLK_REF_VAL_H_REG                    (0x50001606) /* XTAL32M reference cycles, higher 16 bits */
#define CLK_REF_VAL_H_REG_RESET              (0x00000000)

/*=============================*/
struct __CLK_REF_VAL_H_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL_CNT_VAL                      : 16;
};
#define XTAL_CNT_VAL                          (0xFFFF)



/*===========================================================================*/
/* memory map bistctrl2632_ram_00 */
/*===========================================================================*/



#define MBIST_SRAM12_ADDR_REG                (0x50003700) /*  */
#define MBIST_SRAM12_ADDR_REG_RESET          (0x00000000)

/*=============================*/
struct __MBIST_SRAM12_ADDR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_ADDR                        : 1;
};
#define MBIST_ADDR                            (0x0001)



#define MBIST_SRAM12_STATE_REG               (0x50003702) /*  */
#define MBIST_SRAM12_STATE_REG_RESET         (0x00000000)

/*=============================*/
struct __MBIST_SRAM12_STATE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_STATE                       : 1;
};
#define MBIST_STATE                           (0x0001)



#define MBIST_SRAM12_RD_MSB_REG              (0x50003704) /*  */
#define MBIST_SRAM12_RD_MSB_REG_RESET        (0x00000000)

/*=============================*/
struct __MBIST_SRAM12_RD_MSB_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_MSB_DATA                    : 1;
};
#define MBIST_MSB_DATA                        (0x0001)



#define MBIST_SRAM12_RD_LSB_REG              (0x50003706) /*  */
#define MBIST_SRAM12_RD_LSB_REG_RESET        (0x00000000)

/*=============================*/
struct __MBIST_SRAM12_RD_LSB_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_LSB_DATA                    : 1;
};
#define MBIST_LSB_DATA                        (0x0001)



#define MBIST_SRAM3_ADDR_REG                 (0x50003800) /*  */
#define MBIST_SRAM3_ADDR_REG_RESET           (0x00000000)

/*=============================*/
struct __MBIST_SRAM3_ADDR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_ADDR                        : 1;
};
#define MBIST_ADDR                            (0x0001)



#define MBIST_SRAM3_STATE_REG                (0x50003802) /*  */
#define MBIST_SRAM3_STATE_REG_RESET          (0x00000000)

/*=============================*/
struct __MBIST_SRAM3_STATE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_STATE                       : 1;
};
#define MBIST_STATE                           (0x0001)



#define MBIST_SRAM3_RD_MSB_REG               (0x50003804) /*  */
#define MBIST_SRAM3_RD_MSB_REG_RESET         (0x00000000)

/*=============================*/
struct __MBIST_SRAM3_RD_MSB_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_MSB_DATA                    : 1;
};
#define MBIST_MSB_DATA                        (0x0001)



#define MBIST_SRAM3_RD_LSB_REG               (0x50003806) /*  */
#define MBIST_SRAM3_RD_LSB_REG_RESET         (0x00000000)

/*=============================*/
struct __MBIST_SRAM3_RD_LSB_REG
/*=============================*/
{
    volatile uint16_t BITFLD_MBIST_LSB_DATA                    : 1;
};
#define MBIST_LSB_DATA                        (0x0001)



/*===========================================================================*/
/* memory map BLE */
/*===========================================================================*/



#define BLE_RWBLECNTL_REG                    (0x40000000) /* BLE Control register */
#define BLE_RWBLECNTL_REG_RESET              (0x00000000)

/*=============================*/
struct __BLE_RWBLECNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SYNCERR                           : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RXWINSZDEF                        : 4;
    volatile uint32_t BITFLD_RWBLE_EN                          : 1;
    volatile uint32_t BITFLD_ADVERTFILT_EN                     : 1;
    volatile uint32_t                                          : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_HOP_REMAP_DSB                     : 1;
    volatile uint32_t BITFLD_CRC_DSB                           : 1;
    volatile uint32_t BITFLD_WHIT_DSB                          : 1;
    volatile uint32_t BITFLD_CRYPT_DSB                         : 1;
    volatile uint32_t BITFLD_NESN_DSB                          : 1;
    volatile uint32_t BITFLD_SN_DSB                            : 1;
    volatile uint32_t BITFLD_MD_DSB                            : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_SCAN_ABORT                        : 1;
    volatile uint32_t BITFLD_ADVERT_ABORT                      : 1;
    volatile uint32_t BITFLD_RFTEST_ABORT                      : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_SWINT_REQ                         : 1;
    volatile uint32_t BITFLD_REG_SOFT_RST                      : 1;
    volatile uint32_t BITFLD_MASTER_TGSOFT_RST                 : 1;
    volatile uint32_t BITFLD_MASTER_SOFT_RST                   : 1;
};
#define SYNCERR                               (0x0007)
#define RXWINSZDEF                            (0x00F0)
#define RWBLE_EN                              (0x0100)
#define ADVERTFILT_EN                         (0x0200)
#define HOP_REMAP_DSB                         (0x10000)
#define CRC_DSB                               (0x20000)
#define WHIT_DSB                              (0x40000)
#define CRYPT_DSB                             (0x80000)
#define NESN_DSB                              (0x100000)
#define SN_DSB                                (0x200000)
#define MD_DSB                                (0x400000)
#define SCAN_ABORT                            (0x1000000)
#define ADVERT_ABORT                          (0x2000000)
#define RFTEST_ABORT                          (0x4000000)
#define SWINT_REQ                             (0x10000000)
#define REG_SOFT_RST                          (0x20000000)
#define MASTER_TGSOFT_RST                     (0x40000000)
#define MASTER_SOFT_RST                       (0x80000000)



#define BLE_VERSION_REG                      (0x40000004) /* Version register */
#define BLE_VERSION_REG_RESET                (0x07010000)

/*=============================*/
struct __BLE_VERSION_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BUILD                             : 8;
    volatile uint32_t BITFLD_UPG                               : 8;
    volatile uint32_t BITFLD_REL                               : 8;
    volatile uint32_t BITFLD_TYP                               : 8;
};
