ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define BUILD                                 (0x00FF)
#define UPG                                   (0xFF00)
#define REL                                   (0xFF0000)
#define TYP                                   (0xFF000000)



#define BLE_RWBLECONF_REG                    (0x40000008) /* Configuration register */
#define BLE_RWBLECONF_REG_RESET              (0x0F02001F)

/*=============================*/
struct __BLE_RWBLECONF_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BUSWIDTH                          : 1;
    volatile uint32_t BITFLD_USECRYPT                          : 1;
    volatile uint32_t BITFLD_USEDBG                            : 1;
    volatile uint32_t BITFLD_COEX                              : 1;
    volatile uint32_t BITFLD_INTMODE                           : 1;
    volatile uint32_t BITFLD_DMMODE                            : 1;
    volatile uint32_t BITFLD_DECIPHER                          : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_CLK_SEL                           : 6;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_RFIF                              : 7;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_ADD_WIDTH                         : 6;
};
#define BUSWIDTH                              (0x0001)
#define USECRYPT                              (0x0002)
#define USEDBG                                (0x0004)
#define COEX                                  (0x0008)
#define INTMODE                               (0x0010)
#define DMMODE                                (0x0020)
#define DECIPHER                              (0x0040)
#define CLK_SEL                               (0x3F00)
#define RFIF                                  (0x7F0000)
#define ADD_WIDTH                             (0x3F000000)



#define BLE_INTCNTL_REG                      (0x4000000C) /* Interrupt controller register */
#define BLE_INTCNTL_REG_RESET                (0x0000811F)

/*=============================*/
struct __BLE_INTCNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CSCNTINTMSK                       : 1;
    volatile uint32_t BITFLD_RXINTMSK                          : 1;
    volatile uint32_t BITFLD_SLPINTMSK                         : 1;
    volatile uint32_t BITFLD_EVENTINTMSK                       : 1;
    volatile uint32_t BITFLD_CRYPTINTMSK                       : 1;
    volatile uint32_t BITFLD_ERRORINTMSK                       : 1;
    volatile uint32_t BITFLD_GROSSTGTIMINTMSK                  : 1;
    volatile uint32_t BITFLD_FINETGTIMINTMSK                   : 1;
    volatile uint32_t BITFLD_EVENTAPFAINTMSK                   : 1;
    volatile uint32_t BITFLD_SWINTMSK                          : 1;
    volatile uint32_t                                          : 5;
    volatile uint32_t BITFLD_CSCNTDEVMSK                       : 1;
};
#define CSCNTINTMSK                           (0x0001)
#define RXINTMSK                              (0x0002)
#define SLPINTMSK                             (0x0004)
#define EVENTINTMSK                           (0x0008)
#define CRYPTINTMSK                           (0x0010)
#define ERRORINTMSK                           (0x0020)
#define GROSSTGTIMINTMSK                      (0x0040)
#define FINETGTIMINTMSK                       (0x0080)
#define EVENTAPFAINTMSK                       (0x0100)
#define SWINTMSK                              (0x0200)
#define CSCNTDEVMSK                           (0x8000)



#define BLE_INTSTAT_REG                      (0x40000010) /* Interrupt status register */
#define BLE_INTSTAT_REG_RESET                (0x00000000)

/*=============================*/
struct __BLE_INTSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CSCNTINTSTAT                      : 1;
    volatile uint32_t BITFLD_RXINTSTAT                         : 1;
    volatile uint32_t BITFLD_SLPINTSTAT                        : 1;
    volatile uint32_t BITFLD_EVENTINTSTAT                      : 1;
    volatile uint32_t BITFLD_CRYPTINTSTAT                      : 1;
    volatile uint32_t BITFLD_ERRORINTSTAT                      : 1;
    volatile uint32_t BITFLD_GROSSTGTIMINTSTAT                 : 1;
    volatile uint32_t BITFLD_FINETGTIMINTSTAT                  : 1;
    volatile uint32_t BITFLD_EVENTAPFAINTSTAT                  : 1;
    volatile uint32_t BITFLD_SWINTSTAT                         : 1;
};
#define CSCNTINTSTAT                          (0x0001)
#define RXINTSTAT                             (0x0002)
#define SLPINTSTAT                            (0x0004)
#define EVENTINTSTAT                          (0x0008)
#define CRYPTINTSTAT                          (0x0010)
#define ERRORINTSTAT                          (0x0020)
#define GROSSTGTIMINTSTAT                     (0x0040)
#define FINETGTIMINTSTAT                      (0x0080)
#define EVENTAPFAINTSTAT                      (0x0100)
#define SWINTSTAT                             (0x0200)



#define BLE_INTRAWSTAT_REG                   (0x40000014) /* Interrupt raw status register */
#define BLE_INTRAWSTAT_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_INTRAWSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CSCNTINTRAWSTAT                   : 1;
    volatile uint32_t BITFLD_RXINTRAWSTAT                      : 1;
    volatile uint32_t BITFLD_SLPINTRAWSTAT                     : 1;
    volatile uint32_t BITFLD_EVENTINTRAWSTAT                   : 1;
    volatile uint32_t BITFLD_CRYPTINTRAWSTAT                   : 1;
    volatile uint32_t BITFLD_ERRORINTRAWSTAT                   : 1;
    volatile uint32_t BITFLD_GROSSTGTIMINTRAWSTAT              : 1;
    volatile uint32_t BITFLD_FINETGTIMINTRAWSTAT               : 1;
    volatile uint32_t BITFLD_EVENTAPFAINTRAWSTAT               : 1;
    volatile uint32_t BITFLD_SWINTRAWSTAT                      : 1;
};
#define CSCNTINTRAWSTAT                       (0x0001)
#define RXINTRAWSTAT                          (0x0002)
#define SLPINTRAWSTAT                         (0x0004)
#define EVENTINTRAWSTAT                       (0x0008)
#define CRYPTINTRAWSTAT                       (0x0010)
#define ERRORINTRAWSTAT                       (0x0020)
#define GROSSTGTIMINTRAWSTAT                  (0x0040)
#define FINETGTIMINTRAWSTAT                   (0x0080)
#define EVENTAPFAINTRAWSTAT                   (0x0100)
#define SWINTRAWSTAT                          (0x0200)



#define BLE_INTACK_REG                       (0x40000018) /* Interrupt acknowledge register */
#define BLE_INTACK_REG_RESET                 (0x00000000)

/*=============================*/
struct __BLE_INTACK_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CSCNTINTACK                       : 1;
    volatile uint32_t BITFLD_RXINTACK                          : 1;
    volatile uint32_t BITFLD_SLPINTACK                         : 1;
    volatile uint32_t BITFLD_EVENTINTACK                       : 1;
    volatile uint32_t BITFLD_CRYPTINTACK                       : 1;
    volatile uint32_t BITFLD_ERRORINTACK                       : 1;
    volatile uint32_t BITFLD_GROSSTGTIMINTACK                  : 1;
    volatile uint32_t BITFLD_FINETGTIMINTACK                   : 1;
    volatile uint32_t BITFLD_EVENTAPFAINTACK                   : 1;
    volatile uint32_t BITFLD_SWINTACK                          : 1;
};
#define CSCNTINTACK                           (0x0001)
#define RXINTACK                              (0x0002)
#define SLPINTACK                             (0x0004)
#define EVENTINTACK                           (0x0008)
#define CRYPTINTACK                           (0x0010)
#define ERRORINTACK                           (0x0020)
#define GROSSTGTIMINTACK                      (0x0040)
#define FINETGTIMINTACK                       (0x0080)
#define EVENTAPFAINTACK                       (0x0100)
#define SWINTACK                              (0x0200)



#define BLE_BASETIMECNT_REG                  (0x4000001C) /* Base time reference counter */
#define BLE_BASETIMECNT_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_BASETIMECNT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BASETIMECNT                       : 27;
};
