ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define BASETIMECNT                           (0x7FFFFFF)



#define BLE_FINETIMECNT_REG                  (0x40000020) /* Fine time reference counter */
#define BLE_FINETIMECNT_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_FINETIMECNT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FINECNT                           : 10;
};
#define FINECNT                               (0x03FF)



#define BLE_BDADDRL_REG                      (0x40000024) /* BLE device address LSB register */
#define BLE_BDADDRL_REG_RESET                (0x00000000)

/*=============================*/
struct __BLE_BDADDRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BDADDRL                           : 32;
};
#define BDADDRL                               (0xFFFFFFFF)



#define BLE_BDADDRU_REG                      (0x40000028) /* BLE device address MSB register */
#define BLE_BDADDRU_REG_RESET                (0x00000000)

/*=============================*/
struct __BLE_BDADDRU_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BDADDRU                           : 16;
    volatile uint32_t BITFLD_PRIV_NPUB                         : 1;
};
#define BDADDRU                               (0xFFFF)
#define PRIV_NPUB                             (0x10000)



#define BLE_CURRENTRXDESCPTR_REG             (0x4000002C) /* Rx Descriptor Pointer for the Receive Buffer Chained List */
#define BLE_CURRENTRXDESCPTR_REG_RESET       (0x00000000)

/*=============================*/
struct __BLE_CURRENTRXDESCPTR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CURRENTRXDESCPTR                  : 15;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_ETPTR                             : 16;
};
#define CURRENTRXDESCPTR                      (0x7FFF)
#define ETPTR                                 (0xFFFF0000)



#define BLE_DEEPSLCNTL_REG                   (0x40000030) /* Deep-Sleep control register */
#define BLE_DEEPSLCNTL_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_DEEPSLCNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEEP_SLEEP_IRQ_EN                 : 2;
    volatile uint32_t BITFLD_DEEP_SLEEP_ON                     : 1;
    volatile uint32_t BITFLD_DEEP_SLEEP_CORR_EN                : 1;
    volatile uint32_t BITFLD_SOFT_WAKEUP_REQ                   : 1;
    volatile uint32_t                                          : 10;
    volatile uint32_t BITFLD_DEEP_SLEEP_STAT                   : 1;
    volatile uint32_t                                          : 15;
    volatile uint32_t BITFLD_EXTWKUPDSB                        : 1;
};
#define DEEP_SLEEP_IRQ_EN                     (0x0003)
#define DEEP_SLEEP_ON                         (0x0004)
#define DEEP_SLEEP_CORR_EN                    (0x0008)
#define SOFT_WAKEUP_REQ                       (0x0010)
#define DEEP_SLEEP_STAT                       (0x8000)
#define EXTWKUPDSB                            (0x80000000)



#define BLE_DEEPSLWKUP_REG                   (0x40000034) /* Time (measured in Low Power clock cycles) in Deep Sleep Mode before waking-up the device */
#define BLE_DEEPSLWKUP_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_DEEPSLWKUP_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEEPSLTIME                        : 32;
};
#define DEEPSLTIME                            (0xFFFFFFFF)



#define BLE_DEEPSLSTAT_REG                   (0x40000038) /* Duration of the last deep sleep phase register */
#define BLE_DEEPSLSTAT_REG_RESET             (0x00000000)

/*=============================*/
struct __BLE_DEEPSLSTAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEEPSLDUR                         : 32;
};
#define DEEPSLDUR                             (0xFFFFFFFF)



#define BLE_ENBPRESET_REG                    (0x4000003C) /* Time in low power oscillator cycles register */
#define BLE_ENBPRESET_REG_RESET              (0x00000000)

/*=============================*/
struct __BLE_ENBPRESET_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TWIRQ_RESET                       : 10;
    volatile uint32_t BITFLD_TWIRQ_SET                         : 11;
    volatile uint32_t BITFLD_TWEXT                             : 11;
};
#define TWIRQ_RESET                           (0x03FF)
#define TWIRQ_SET                             (0x1FFC00)
#define TWEXT                                 (0xFFE00000)



#define BLE_FINECNTCORR_REG                  (0x40000040) /* Phase correction value register */
#define BLE_FINECNTCORR_REG_RESET            (0x00000000)

/*=============================*/
struct __BLE_FINECNTCORR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FINECNTCORR                       : 10;
};
#define FINECNTCORR                           (0x03FF)



#define BLE_BASETIMECNTCORR_REG              (0x40000044) /* Base Time Counter */
#define BLE_BASETIMECNTCORR_REG_RESET        (0x00000000)

/*=============================*/
struct __BLE_BASETIMECNTCORR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BASETIMECNTCORR                   : 27;
};
#define BASETIMECNTCORR                       (0x7FFFFFF)



#define BLE_DIAGCNTL_REG                     (0x40000050) /* Diagnostics Register */
#define BLE_DIAGCNTL_REG_RESET               (0x00000000)

/*=============================*/
struct __BLE_DIAGCNTL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG0                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG0_EN                          : 1;
    volatile uint32_t BITFLD_DIAG1                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG1_EN                          : 1;
    volatile uint32_t BITFLD_DIAG2                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG2_EN                          : 1;
    volatile uint32_t BITFLD_DIAG3                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG3_EN                          : 1;
};
