ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define WLCPDELAY                             (0x007F)
#define WLCPDURATION                          (0x7F00)
#define WLCPTXTHR                             (0x1F0000)
#define WLCPRXTHR                             (0x1F000000)



#define BLE_BLEMPRIO0_REG                    (0x40000108) /* Coexistence interface Priority 0 Register */
#define BLE_BLEMPRIO0_REG_RESET              (0x3489ADEF)

/*=============================*/
struct __BLE_BLEMPRIO0_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BLEM0                             : 4;
    volatile uint32_t BITFLD_BLEM1                             : 4;
    volatile uint32_t BITFLD_BLEM2                             : 4;
    volatile uint32_t BITFLD_BLEM3                             : 4;
    volatile uint32_t BITFLD_BLEM4                             : 4;
    volatile uint32_t BITFLD_BLEM5                             : 4;
    volatile uint32_t BITFLD_BLEM6                             : 4;
    volatile uint32_t BITFLD_BLEM7                             : 4;
};
#define BLEM0                                 (0x000F)
#define BLEM1                                 (0x00F0)
#define BLEM2                                 (0x0F00)
#define BLEM3                                 (0xF000)
#define BLEM4                                 (0xF0000)
#define BLEM5                                 (0xF00000)
#define BLEM6                                 (0xF000000)
#define BLEM7                                 (0xF0000000)



#define BLE_BLEMPRIO1_REG                    (0x4000010C) /* Coexistence interface Priority 1 Register */
#define BLE_BLEMPRIO1_REG_RESET              (0x30000000)

/*=============================*/
struct __BLE_BLEMPRIO1_REG
/*=============================*/
{
    volatile uint32_t                                          : 28;
    volatile uint32_t BITFLD_BLEMDEFAULT                       : 4;
};
#define BLEMDEFAULT                           (0xF0000000)



#define BLE_CNTL2_REG                        (0x40000200) /* BLE Control Register 2 */
#define BLE_CNTL2_REG_RESET                  (0x00000004)

/*=============================*/
struct __BLE_CNTL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_EMACCERRSTAT                      : 1;
    volatile uint32_t BITFLD_EMACCERRACK                       : 1;
    volatile uint32_t BITFLD_EMACCERRMSK                       : 1;
    volatile uint32_t BITFLD_BLE_DIAG_OVR                      : 1;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_BLE_CLK_STAT                      : 1;
    volatile uint32_t BITFLD_MON_LP_CLK                        : 1;
    volatile uint32_t BITFLD_RADIO_PWRDN_ALLOW                 : 1;
    volatile uint32_t BITFLD_BLE_CLK_SEL                       : 6;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_BLE_PTI_SOURCE_SEL                : 1;
    volatile uint32_t BITFLD_BB_ONLY                           : 1;
    volatile uint32_t BITFLD_SW_RPL_SPI                        : 1;
    volatile uint32_t BITFLD_WAKEUPLPSTAT                      : 1;
    volatile uint32_t BITFLD_BLE_RSSI_SEL                      : 1;
    volatile uint32_t BITFLD_BLE_ARP_PHY_ERR_STAT              : 1;
    volatile uint32_t BITFLD_BLE_ARP_ERR_MSK_N                 : 1;
    volatile uint32_t BITFLD_BLE_PHY_ERR_MSK_N                 : 1;
};
#define EMACCERRSTAT                          (0x0001)
#define EMACCERRACK                           (0x0002)
#define EMACCERRMSK                           (0x0004)
#define BLE_DIAG_OVR                          (0x0008)
#define BLE_CLK_STAT                          (0x0040)
#define MON_LP_CLK                            (0x0080)
#define RADIO_PWRDN_ALLOW                     (0x0100)
#define BLE_CLK_SEL                           (0x7E00)
#define BLE_PTI_SOURCE_SEL                    (0x20000)
#define BB_ONLY                               (0x40000)
#define SW_RPL_SPI                            (0x80000)
#define WAKEUPLPSTAT                          (0x100000)
#define BLE_RSSI_SEL                          (0x200000)
#define BLE_ARP_PHY_ERR_STAT                  (0x400000)
#define BLE_ARP_ERR_MSK_N                     (0x800000)
#define BLE_PHY_ERR_MSK_N                     (0x1000000)



#define BLE_EM_BASE_REG                      (0x40000208) /* Exchange Memory Base Register */
#define BLE_EM_BASE_REG_RESET                (0x00000000)

/*=============================*/
struct __BLE_EM_BASE_REG
/*=============================*/
{
    volatile uint32_t                                          : 10;
    volatile uint32_t BITFLD_BLE_EM_BASE_16_10                 : 7;
};
#define BLE_EM_BASE_16_10                     (0x1FC00)



#define BLE_DIAGCNTL2_REG                    (0x4000020C) /* Debug use only */
#define BLE_DIAGCNTL2_REG_RESET              (0x00000000)

/*=============================*/
struct __BLE_DIAGCNTL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG4                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG4_EN                          : 1;
    volatile uint32_t BITFLD_DIAG5                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG5_EN                          : 1;
    volatile uint32_t BITFLD_DIAG6                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG6_EN                          : 1;
    volatile uint32_t BITFLD_DIAG7                             : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG7_EN                          : 1;
};
#define DIAG4                                 (0x003F)
#define DIAG4_EN                              (0x0080)
#define DIAG5                                 (0x3F00)
#define DIAG5_EN                              (0x8000)
#define DIAG6                                 (0x3F0000)
#define DIAG6_EN                              (0x800000)
#define DIAG7                                 (0x3F000000)
#define DIAG7_EN                              (0x80000000)



#define BLE_DIAGCNTL3_REG                    (0x40000210) /* Debug use only */
#define BLE_DIAGCNTL3_REG_RESET              (0x00000000)

/*=============================*/
struct __BLE_DIAGCNTL3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG0_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG0_INV                         : 1;
    volatile uint32_t BITFLD_DIAG1_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG1_INV                         : 1;
    volatile uint32_t BITFLD_DIAG2_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG2_INV                         : 1;
    volatile uint32_t BITFLD_DIAG3_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG3_INV                         : 1;
    volatile uint32_t BITFLD_DIAG4_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG4_INV                         : 1;
    volatile uint32_t BITFLD_DIAG5_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG5_INV                         : 1;
    volatile uint32_t BITFLD_DIAG6_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG6_INV                         : 1;
    volatile uint32_t BITFLD_DIAG7_BIT                         : 3;
    volatile uint32_t BITFLD_DIAG7_INV                         : 1;
};
#define DIAG0_BIT                             (0x0007)
#define DIAG0_INV                             (0x0008)
#define DIAG1_BIT                             (0x0070)
#define DIAG1_INV                             (0x0080)
#define DIAG2_BIT                             (0x0700)
#define DIAG2_INV                             (0x0800)
#define DIAG3_BIT                             (0x7000)
#define DIAG3_INV                             (0x8000)
#define DIAG4_BIT                             (0x70000)
#define DIAG4_INV                             (0x80000)
#define DIAG5_BIT                             (0x700000)
#define DIAG5_INV                             (0x800000)
#define DIAG6_BIT                             (0x7000000)
#define DIAG6_INV                             (0x8000000)
#define DIAG7_BIT                             (0x70000000)
#define DIAG7_INV                             (0x80000000)



/*===========================================================================*/
/* memory map CRG */
/*===========================================================================*/



#define CLK_AMBA_REG                         (0x50000000) /* HCLK, PCLK, divider and clock gates */
#define CLK_AMBA_REG_RESET                   (0x00000000)

/*=============================*/
struct __CLK_AMBA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_HCLK_DIV                          : 2;
    volatile uint16_t                                          : 2;
    volatile uint16_t BITFLD_PCLK_DIV                          : 2;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_OTP_ENABLE                        : 1;
};
