ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define HCLK_DIV                              (0x0003)
#define PCLK_DIV                              (0x0030)
#define OTP_ENABLE                            (0x0080)



#define CLK_FREQ_TRIM_REG                    (0x50000002) /* Xtal frequency trimming register */
#define CLK_FREQ_TRIM_REG_RESET              (0x00000080)

/*=============================*/
struct __CLK_FREQ_TRIM_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32M_TRIM                      : 8;
};
#define XTAL32M_TRIM                          (0x00FF)



#define CLK_PER_REG                          (0x50000004) /* Peripheral divider register */
#define CLK_PER_REG_RESET                    (0x00000800)

/*=============================*/
struct __CLK_PER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TMR_DIV                           : 2;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_TMR_ENABLE                        : 1;
    volatile uint16_t BITFLD_WAKEUPCT_ENABLE                   : 1;
    volatile uint16_t BITFLD_I2C_ENABLE                        : 1;
    volatile uint16_t BITFLD_UART2_ENABLE                      : 1;
    volatile uint16_t BITFLD_UART1_ENABLE                      : 1;
    volatile uint16_t                                          : 2;
    volatile uint16_t BITFLD_SPI_ENABLE                        : 1;
    volatile uint16_t BITFLD_QUAD_ENABLE                       : 1;
};
#define TMR_DIV                               (0x0003)
#define TMR_ENABLE                            (0x0008)
#define WAKEUPCT_ENABLE                       (0x0010)
#define I2C_ENABLE                            (0x0020)
#define UART2_ENABLE                          (0x0040)
#define UART1_ENABLE                          (0x0080)
#define SPI_ENABLE                            (0x0400)
#define QUAD_ENABLE                           (0x0800)



#define CLK_RADIO_REG                        (0x50000008) /* Radio PLL control register */
#define CLK_RADIO_REG_RESET                  (0x00000040)

/*=============================*/
struct __CLK_RADIO_REG
/*=============================*/
{
    volatile uint16_t                                          : 2;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_RFCU_ENABLE                       : 1;
    volatile uint16_t BITFLD_BLE_DIV                           : 2;
    volatile uint16_t BITFLD_BLE_LP_RESET                      : 1;
    volatile uint16_t BITFLD_BLE_ENABLE                        : 1;
};
#define RFCU_ENABLE                           (0x0008)
#define BLE_DIV                               (0x0030)
#define BLE_LP_RESET                          (0x0040)
#define BLE_ENABLE                            (0x0080)



#define CLK_CTRL_REG                         (0x5000000A) /* Clock control register */
#define CLK_CTRL_REG_RESET                   (0x00000041)

/*=============================*/
struct __CLK_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SYS_CLK_SEL                       : 2;
    volatile uint16_t BITFLD_XTAL32M_DISABLE                   : 1;
    volatile uint16_t BITFLD_LP_CLK_SEL                        : 2;
    volatile uint16_t BITFLD_RUNNING_AT_LP_CLK                 : 1;
    volatile uint16_t BITFLD_RUNNING_AT_RC32M                  : 1;
    volatile uint16_t BITFLD_RUNNING_AT_XTAL32M                : 1;
};
#define SYS_CLK_SEL                           (0x0003)
#define XTAL32M_DISABLE                       (0x0004)
#define LP_CLK_SEL                            (0x0018)
#define RUNNING_AT_LP_CLK                     (0x0020)
#define RUNNING_AT_RC32M                      (0x0040)
#define RUNNING_AT_XTAL32M                    (0x0080)



#define PMU_CTRL_REG                         (0x50000010) /* Power Management Unit control register */
#define PMU_CTRL_REG_RESET                   (0x00000006)

/*=============================*/
struct __PMU_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RESET_ON_WAKEUP                   : 1;
    volatile uint16_t BITFLD_TIM_SLEEP                         : 1;
    volatile uint16_t BITFLD_RADIO_SLEEP                       : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_OTP_COPY_DIV                      : 2;
    volatile uint16_t BITFLD_MAP_BANDGAP_EN                    : 1;
};
#define RESET_ON_WAKEUP                       (0x0001)
#define TIM_SLEEP                             (0x0002)
#define RADIO_SLEEP                           (0x0004)
#define OTP_COPY_DIV                          (0x0030)
#define MAP_BANDGAP_EN                        (0x0040)



#define SYS_CTRL_REG                         (0x50000012) /* System Control register */
#define SYS_CTRL_REG_RESET                   (0x00000020)

/*=============================*/
struct __SYS_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_REMAP_ADR0                        : 2;
    volatile uint16_t BITFLD_DEV_PHASE                         : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_OTP_COPY                          : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_OTPC_RESET_REQ                    : 1;
    volatile uint16_t BITFLD_DEBUGGER_ENABLE                   : 2;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_TIMEOUT_DISABLE                   : 1;
    volatile uint16_t                                          : 4;
    volatile uint16_t BITFLD_SW_RESET                          : 1;
};
#define REMAP_ADR0                            (0x0003)
#define DEV_PHASE                             (0x0004)
#define OTP_COPY                              (0x0010)
#define OTPC_RESET_REQ                        (0x0040)
#define DEBUGGER_ENABLE                       (0x0180)
#define TIMEOUT_DISABLE                       (0x0400)
#define SW_RESET                              (0x8000)



#define SYS_STAT_REG                         (0x50000014) /* System status register */
#define SYS_STAT_REG_RESET                   (0x00000045)

/*=============================*/
struct __SYS_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAD_IS_DOWN                       : 1;
    volatile uint16_t BITFLD_RAD_IS_UP                         : 1;
    volatile uint16_t BITFLD_TIM_IS_DOWN                       : 1;
    volatile uint16_t BITFLD_TIM_IS_UP                         : 1;
    volatile uint16_t BITFLD_DBG_IS_UP                         : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_XTAL32M_TRIM_READY                : 1;
    volatile uint16_t BITFLD_XTAL32M_SETTLED                   : 1;
};
#define RAD_IS_DOWN                           (0x0001)
#define RAD_IS_UP                             (0x0002)
#define TIM_IS_DOWN                           (0x0004)
#define TIM_IS_UP                             (0x0008)
#define DBG_IS_UP                             (0x0010)
#define XTAL32M_TRIM_READY                    (0x0040)
#define XTAL32M_SETTLED                       (0x0080)



#define TRIM_CTRL_REG                        (0x50000016) /* Control trimming of the XTAL32M */
#define TRIM_CTRL_REG_RESET                  (0x00003F22)

/*=============================*/
struct __TRIM_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL_COUNT_N                      : 6;
    volatile uint16_t BITFLD_XTAL_TRIM_SELECT                  : 2;
    volatile uint16_t BITFLD_XTAL_SETTLE_N                     : 6;
};
#define XTAL_COUNT_N                          (0x003F)
#define XTAL_TRIM_SELECT                      (0x00C0)
#define XTAL_SETTLE_N                         (0x3F00)



