ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RAM_PWR_CTRL_REG                     (0x50000018) /* Control power state of System RAMS */
#define RAM_PWR_CTRL_REG_RESET               (0x00000000)

/*=============================*/
struct __RAM_PWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAM1_PWR_CTRL                     : 2;
    volatile uint16_t BITFLD_RAM2_PWR_CTRL                     : 2;
    volatile uint16_t BITFLD_RAM3_PWR_CTRL                     : 2;
};
#define RAM1_PWR_CTRL                         (0x0003)
#define RAM2_PWR_CTRL                         (0x000C)
#define RAM3_PWR_CTRL                         (0x0030)



#define CLK_RC32K_REG                        (0x50000020) /* 32 kHz RC oscillator register */
#define CLK_RC32K_REG_RESET                  (0x0000000E)

/*=============================*/
struct __CLK_RC32K_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RC32K_DISABLE                     : 1;
    volatile uint16_t BITFLD_RC32K_TRIM                        : 4;
};
#define RC32K_DISABLE                         (0x0001)
#define RC32K_TRIM                            (0x001E)



#define CLK_RCX_REG                          (0x50000026) /* RCX-oscillator control register */
#define CLK_RCX_REG_RESET                    (0x00000AFC)

/*=============================*/
struct __CLK_RCX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RCX_ENABLE                        : 1;
    volatile uint16_t BITFLD_RCX_RADJUST                       : 1;
    volatile uint16_t BITFLD_RCX_CADJUST                       : 5;
    volatile uint16_t BITFLD_RCX_C0                            : 1;
    volatile uint16_t BITFLD_RCX_BIAS                          : 4;
};
#define RCX_ENABLE                            (0x0001)
#define RCX_RADJUST                           (0x0002)
#define RCX_CADJUST                           (0x007C)
#define RCX_C0                                (0x0080)
#define RCX_BIAS                              (0x0F00)



#define BANDGAP_REG                          (0x50000028) /* Bandgap trimming */
#define BANDGAP_REG_RESET                    (0x00000000)

/*=============================*/
struct __BANDGAP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BGR_TRIM                          : 5;
    volatile uint16_t BITFLD_BGR_ITRIM                         : 5;
};
#define BGR_TRIM                              (0x001F)
#define BGR_ITRIM                             (0x03E0)



#define XTAL32M_START_REG                    (0x50000030) /* Trim values for XTAL32M */
#define XTAL32M_START_REG_RESET              (0x000000AA)

/*=============================*/
struct __XTAL32M_START_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTAL32M_START                     : 8;
    volatile uint16_t BITFLD_XTAL32M_RAMP                      : 8;
};
#define XTAL32M_START                         (0x00FF)
#define XTAL32M_RAMP                          (0xFF00)



#define XTALRDY_CTRL_REG                     (0x50000034) /* Control register for XTALRDY IRQ */
#define XTALRDY_CTRL_REG_RESET               (0x00000000)

/*=============================*/
struct __XTALRDY_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_XTALRDY_CNT                       : 8;
};
#define XTALRDY_CNT                           (0x00FF)



#define POR_PIN_REG                          (0x50000040) /* Selects a GPIO pin for POR generation */
#define POR_PIN_REG_RESET                    (0x00000000)

/*=============================*/
struct __POR_PIN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_PIN_SELECT                    : 4;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_POR_PIN_POLARITY                  : 1;
};
#define POR_PIN_SELECT                        (0x000F)
#define POR_PIN_POLARITY                      (0x0080)



#define POR_TIMER_REG                        (0x50000042) /* Time for POR to happen */
#define POR_TIMER_REG_RESET                  (0x00000018)

/*=============================*/
struct __POR_TIMER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_POR_TIME                          : 7;
};
#define POR_TIME                              (0x007F)



#define PMU_SLEEP_REG                        (0x50000050) /*  */
#define PMU_SLEEP_REG_RESET                  (0x00000080)

/*=============================*/
struct __PMU_SLEEP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BG_REFRESH_INTERVAL               : 12;
};
#define BG_REFRESH_INTERVAL                   (0x0FFF)



#define POWER_CTRL_REG                       (0x50000052) /*  */
#define POWER_CTRL_REG_RESET                 (0x00004000)

/*=============================*/
struct __POWER_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CMP_VBAT_HIGH_NOK_ENABLE          : 1;
    volatile uint16_t BITFLD_CMP_VBAT_HIGH_OK_ENABLE           : 1;
    volatile uint16_t BITFLD_VBAT_HL_CONNECT                   : 1;
    volatile uint16_t BITFLD_LDO_CORE_RET_ENABLE               : 1;
    volatile uint16_t BITFLD_LDO_CORE_DISABLE                  : 1;
    volatile uint16_t BITFLD_LDO_LOW_CTRL_REG                  : 2;
    volatile uint16_t BITFLD_LDO_VREF_HOLD_FORCE               : 1;
    volatile uint16_t BITFLD_CP_DISABLE                        : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_DISABLE              : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_HYST_SEL             : 1;
    volatile uint16_t BITFLD_POR_VBAT_LOW_HYST_DIS             : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_DISABLE             : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_HYST_SEL            : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_HYST_DIS            : 1;
    volatile uint16_t BITFLD_VBAT_HL_CONNECT_MODE              : 1;
};
#define CMP_VBAT_HIGH_NOK_ENABLE              (0x0001)
#define CMP_VBAT_HIGH_OK_ENABLE               (0x0002)
#define VBAT_HL_CONNECT                       (0x0004)
#define LDO_CORE_RET_ENABLE                   (0x0008)
#define LDO_CORE_DISABLE                      (0x0010)
#define LDO_LOW_CTRL_REG                      (0x0060)
#define LDO_VREF_HOLD_FORCE                   (0x0080)
#define CP_DISABLE                            (0x0100)
#define POR_VBAT_LOW_DISABLE                  (0x0200)
#define POR_VBAT_LOW_HYST_SEL                 (0x0400)
#define POR_VBAT_LOW_HYST_DIS                 (0x0800)
#define POR_VBAT_HIGH_DISABLE                 (0x1000)
#define POR_VBAT_HIGH_HYST_SEL                (0x2000)
#define POR_VBAT_HIGH_HYST_DIS                (0x4000)
#define VBAT_HL_CONNECT_MODE                  (0x8000)



#define POWER_LEVEL_REG                      (0x50000054) /*  */
#define POWER_LEVEL_REG_RESET                (0x00001A3E)

/*=============================*/
struct __POWER_LEVEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_LDO_CORE_LEVEL                    : 1;
    volatile uint16_t BITFLD_LDO_LOW_TRIM                      : 3;
    volatile uint16_t BITFLD_LDO_XTAL_TRIM                     : 3;
    volatile uint16_t BITFLD_LDO_CORE_RET_CUR_TRIM             : 2;
    volatile uint16_t BITFLD_DCDC_LEVEL                        : 2;
    volatile uint16_t BITFLD_DCDC_TRIM                         : 3;
};
#define LDO_CORE_LEVEL                        (0x0001)
#define LDO_LOW_TRIM                          (0x000E)
#define LDO_XTAL_TRIM                         (0x0070)
#define LDO_CORE_RET_CUR_TRIM                 (0x0180)
#define DCDC_LEVEL                            (0x0600)
#define DCDC_TRIM                             (0x3800)



/*===========================================================================*/
/* memory map crg2632_dcdc_dig_00 */
/*===========================================================================*/



#define DCDC_CTRL_REG                        (0x50000080) /*  */
#define DCDC_CTRL_REG_RESET                  (0x000084A2)

/*=============================*/
struct __DCDC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DCDC_ENABLE                       : 1;
    volatile uint16_t BITFLD_DCDC_CLK_DIV                      : 2;
    volatile uint16_t BITFLD_DCDC_TIMEOUT                      : 3;
    volatile uint16_t BITFLD_DCDC_OK_CLR_CNT                   : 2;
    volatile uint16_t BITFLD_DCDC_ILIM_MIN                     : 4;
    volatile uint16_t BITFLD_DCDC_ILIM_MAX                     : 4;
};
#define DCDC_ENABLE                           (0x0001)
#define DCDC_CLK_DIV                          (0x0006)
#define DCDC_TIMEOUT                          (0x0038)
#define DCDC_OK_CLR_CNT                       (0x00C0)
#define DCDC_ILIM_MIN                         (0x0F00)
#define DCDC_ILIM_MAX                         (0xF000)



/*===========================================================================*/
/* memory map crg2632_preg_aon_00 */
/*===========================================================================*/



#define HWR_CTRL_REG                         (0x50000300) /* Hardware Reset control register */
#define HWR_CTRL_REG_RESET                   (0x00000000)

/*=============================*/
struct __HWR_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DISABLE_HWR                       : 1;
};
#define DISABLE_HWR                           (0x0001)



#define RESET_STAT_REG                       (0x50000304) /* Reset status register */
#define RESET_STAT_REG_RESET                 (0x0000000F)

/*=============================*/
struct __RESET_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PORESET_STAT                      : 1;
    volatile uint16_t BITFLD_HWRESET_STAT                      : 1;
    volatile uint16_t BITFLD_SWRESET_STAT                      : 1;
    volatile uint16_t BITFLD_WDOGRESET_STAT                    : 1;
};
#define PORESET_STAT                          (0x0001)
#define HWRESET_STAT                          (0x0002)
#define SWRESET_STAT                          (0x0004)
#define WDOGRESET_STAT                        (0x0008)



#define RAM_LPMX_REG                         (0x50000308) /*  */
#define RAM_LPMX_REG_RESET                   (0x00000007)

/*=============================*/
struct __RAM_LPMX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RAMx_LPMX                         : 3;
};
#define RAMx_LPMX                             (0x0007)



