ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define PAD_LATCH_REG                        (0x5000030C) /* Control the state retention of the GPIO ports */
#define PAD_LATCH_REG_RESET                  (0x00000001)

/*=============================*/
struct __PAD_LATCH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PAD_LATCH_EN                      : 1;
};
#define PAD_LATCH_EN                          (0x0001)



#define HIBERN_CTRL_REG                      (0x50000310) /* Hibernation control register */
#define HIBERN_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __HIBERN_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_HIBERNATION_ENABLE                : 1;
    volatile uint16_t BITFLD_HIBERN_WKUP_POLARITY              : 1;
    volatile uint16_t BITFLD_HIBERN_WKUP_MASK                  : 5;
};
#define HIBERNATION_ENABLE                    (0x0001)
#define HIBERN_WKUP_POLARITY                  (0x0002)
#define HIBERN_WKUP_MASK                      (0x007C)



/*===========================================================================*/
/* memory map crg2632_preg_tim_00 */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map DEM */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map DMA */
/*===========================================================================*/



#define DMA0_A_STARTL_REG                    (0x50003600) /* Start address Low A of DMA channel 0 */
#define DMA0_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_A_STARTL                     : 16;
};
#define DMA0_A_STARTL                         (0xFFFF)



#define DMA0_A_STARTH_REG                    (0x50003602) /* Start address High A of DMA channel 0 */
#define DMA0_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_A_STARTH                     : 16;
};
#define DMA0_A_STARTH                         (0xFFFF)



#define DMA0_B_STARTL_REG                    (0x50003604) /* Start address Low B of DMA channel 0 */
#define DMA0_B_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_B_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_B_STARTL                     : 16;
};
#define DMA0_B_STARTL                         (0xFFFF)



#define DMA0_B_STARTH_REG                    (0x50003606) /* Start address High B of DMA channel 0 */
#define DMA0_B_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA0_B_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_B_STARTH                     : 16;
};
#define DMA0_B_STARTH                         (0xFFFF)



#define DMA0_INT_REG                         (0x50003608) /* DMA receive interrupt register channel 0 */
#define DMA0_INT_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA0_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_INT                          : 16;
};
#define DMA0_INT                              (0xFFFF)



#define DMA0_LEN_REG                         (0x5000360A) /* DMA receive length register channel 0 */
#define DMA0_LEN_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA0_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_LEN                          : 16;
};
#define DMA0_LEN                              (0xFFFF)



#define DMA0_CTRL_REG                        (0x5000360C) /* Control register for the DMA channel 0 */
#define DMA0_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __DMA0_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_ON                            : 1;
    volatile uint16_t BITFLD_BW                                : 2;
    volatile uint16_t BITFLD_IRQ_ENABLE                        : 1;
    volatile uint16_t BITFLD_DREQ_MODE                         : 1;
    volatile uint16_t BITFLD_BINC                              : 1;
    volatile uint16_t BITFLD_AINC                              : 1;
    volatile uint16_t BITFLD_CIRCULAR                          : 1;
    volatile uint16_t BITFLD_DMA_PRIO                          : 3;
    volatile uint16_t BITFLD_DMA_IDLE                          : 1;
    volatile uint16_t BITFLD_DMA_INIT                          : 1;
    volatile uint16_t BITFLD_REQ_SENSE                         : 1;
};
#define DMA_ON                                (0x0001)
#define BW                                    (0x0006)
#define IRQ_ENABLE                            (0x0008)
#define DREQ_MODE                             (0x0010)
#define BINC                                  (0x0020)
#define AINC                                  (0x0040)
#define CIRCULAR                              (0x0080)
#define DMA_PRIO                              (0x0700)
#define DMA_IDLE                              (0x0800)
#define DMA_INIT                              (0x1000)
#define REQ_SENSE                             (0x2000)



#define DMA0_IDX_REG                         (0x5000360E) /* Index value of DMA channel 0 */
#define DMA0_IDX_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA0_IDX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA0_IDX                          : 16;
};
#define DMA0_IDX                              (0xFFFF)



#define DMA1_A_STARTL_REG                    (0x50003610) /* Start address Low A of DMA channel 1 */
#define DMA1_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA1_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_A_STARTL                     : 16;
};
