ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define DMA1_A_STARTL                         (0xFFFF)



#define DMA1_A_STARTH_REG                    (0x50003612) /* Start address High A of DMA channel 1 */
#define DMA1_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA1_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_A_STARTH                     : 16;
};
#define DMA1_A_STARTH                         (0xFFFF)



#define DMA1_B_STARTL_REG                    (0x50003614) /* Start address Low B of DMA channel 1 */
#define DMA1_B_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA1_B_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_B_STARTL                     : 16;
};
#define DMA1_B_STARTL                         (0xFFFF)



#define DMA1_B_STARTH_REG                    (0x50003616) /* Start address High B of DMA channel 1 */
#define DMA1_B_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA1_B_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_B_STARTH                     : 16;
};
#define DMA1_B_STARTH                         (0xFFFF)



#define DMA1_INT_REG                         (0x50003618) /* DMA receive interrupt register channel 1 */
#define DMA1_INT_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA1_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_INT                          : 16;
};
#define DMA1_INT                              (0xFFFF)



#define DMA1_LEN_REG                         (0x5000361A) /* DMA receive length register channel 1 */
#define DMA1_LEN_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA1_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_LEN                          : 16;
};
#define DMA1_LEN                              (0xFFFF)



#define DMA1_CTRL_REG                        (0x5000361C) /* Control register for the DMA channel 1 */
#define DMA1_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __DMA1_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_ON                            : 1;
    volatile uint16_t BITFLD_BW                                : 2;
    volatile uint16_t BITFLD_IRQ_ENABLE                        : 1;
    volatile uint16_t BITFLD_DREQ_MODE                         : 1;
    volatile uint16_t BITFLD_BINC                              : 1;
    volatile uint16_t BITFLD_AINC                              : 1;
    volatile uint16_t BITFLD_CIRCULAR                          : 1;
    volatile uint16_t BITFLD_DMA_PRIO                          : 3;
    volatile uint16_t BITFLD_DMA_IDLE                          : 1;
    volatile uint16_t BITFLD_DMA_INIT                          : 1;
    volatile uint16_t BITFLD_REQ_SENSE                         : 1;
};
#define DMA_ON                                (0x0001)
#define BW                                    (0x0006)
#define IRQ_ENABLE                            (0x0008)
#define DREQ_MODE                             (0x0010)
#define BINC                                  (0x0020)
#define AINC                                  (0x0040)
#define CIRCULAR                              (0x0080)
#define DMA_PRIO                              (0x0700)
#define DMA_IDLE                              (0x0800)
#define DMA_INIT                              (0x1000)
#define REQ_SENSE                             (0x2000)



#define DMA1_IDX_REG                         (0x5000361E) /* Index value of DMA channel 1 */
#define DMA1_IDX_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA1_IDX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA1_IDX                          : 16;
};
#define DMA1_IDX                              (0xFFFF)



#define DMA2_A_STARTL_REG                    (0x50003620) /* Start address Low A of DMA channel 2 */
#define DMA2_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA2_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_A_STARTL                     : 16;
};
#define DMA2_A_STARTL                         (0xFFFF)



#define DMA2_A_STARTH_REG                    (0x50003622) /* Start address High A of DMA channel 2 */
#define DMA2_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA2_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_A_STARTH                     : 16;
};
#define DMA2_A_STARTH                         (0xFFFF)



#define DMA2_B_STARTL_REG                    (0x50003624) /* Start address Low B of DMA channel 2 */
#define DMA2_B_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA2_B_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_B_STARTL                     : 16;
};
#define DMA2_B_STARTL                         (0xFFFF)



#define DMA2_B_STARTH_REG                    (0x50003626) /* Start address High B of DMA channel 2 */
#define DMA2_B_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA2_B_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_B_STARTH                     : 16;
};
#define DMA2_B_STARTH                         (0xFFFF)



#define DMA2_INT_REG                         (0x50003628) /* DMA receive interrupt register channel 2 */
#define DMA2_INT_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA2_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_INT                          : 16;
};
#define DMA2_INT                              (0xFFFF)



#define DMA2_LEN_REG                         (0x5000362A) /* DMA receive length register channel 2 */
#define DMA2_LEN_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA2_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_LEN                          : 16;
};
#define DMA2_LEN                              (0xFFFF)



#define DMA2_CTRL_REG                        (0x5000362C) /* Control register for the DMA channel 2 */
#define DMA2_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __DMA2_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA_ON                            : 1;
    volatile uint16_t BITFLD_BW                                : 2;
    volatile uint16_t BITFLD_IRQ_ENABLE                        : 1;
    volatile uint16_t BITFLD_DREQ_MODE                         : 1;
    volatile uint16_t BITFLD_BINC                              : 1;
    volatile uint16_t BITFLD_AINC                              : 1;
    volatile uint16_t BITFLD_CIRCULAR                          : 1;
    volatile uint16_t BITFLD_DMA_PRIO                          : 3;
    volatile uint16_t BITFLD_DMA_IDLE                          : 1;
    volatile uint16_t BITFLD_DMA_INIT                          : 1;
    volatile uint16_t BITFLD_REQ_SENSE                         : 1;
};
#define DMA_ON                                (0x0001)
#define BW                                    (0x0006)
#define IRQ_ENABLE                            (0x0008)
#define DREQ_MODE                             (0x0010)
#define BINC                                  (0x0020)
#define AINC                                  (0x0040)
#define CIRCULAR                              (0x0080)
#define DMA_PRIO                              (0x0700)
#define DMA_IDLE                              (0x0800)
#define DMA_INIT                              (0x1000)
#define REQ_SENSE                             (0x2000)



#define DMA2_IDX_REG                         (0x5000362E) /* Index value of DMA channel 2 */
#define DMA2_IDX_REG_RESET                   (0x00000000)

/*=============================*/
struct __DMA2_IDX_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA2_IDX                          : 16;
};
#define DMA2_IDX                              (0xFFFF)



#define DMA3_A_STARTL_REG                    (0x50003630) /* Start address Low A of DMA channel 3 */
#define DMA3_A_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_A_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_A_STARTL                     : 16;
};
#define DMA3_A_STARTL                         (0xFFFF)



#define DMA3_A_STARTH_REG                    (0x50003632) /* Start address High A of DMA channel 3 */
#define DMA3_A_STARTH_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_A_STARTH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_A_STARTH                     : 16;
};
#define DMA3_A_STARTH                         (0xFFFF)



#define DMA3_B_STARTL_REG                    (0x50003634) /* Start address Low B of DMA channel 3 */
#define DMA3_B_STARTL_REG_RESET              (0x00000000)

/*=============================*/
struct __DMA3_B_STARTL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMA3_B_STARTL                     : 16;
};
