ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define GP_ADC_EN_DEL                         (0x00FF)
#define GP_ADC_INTERVAL                       (0xFF00)



#define GP_ADC_OFFP_REG                      (0x50001508) /* General Purpose ADC Positive Offset Register */
#define GP_ADC_OFFP_REG_RESET                (0x00000200)

/*=============================*/
struct __GP_ADC_OFFP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_OFFP                       : 10;
};
#define GP_ADC_OFFP                           (0x03FF)



#define GP_ADC_OFFN_REG                      (0x5000150A) /* General Purpose ADC Negative Offset Register */
#define GP_ADC_OFFN_REG_RESET                (0x00000200)

/*=============================*/
struct __GP_ADC_OFFN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_OFFN                       : 10;
};
#define GP_ADC_OFFN                           (0x03FF)



#define GP_ADC_TRIM_REG                      (0x5000150C) /* General Purpose ADC Trim Register */
#define GP_ADC_TRIM_REG_RESET                (0x00000038)

/*=============================*/
struct __GP_ADC_TRIM_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_OFFS_SH_VREF               : 4;
    volatile uint16_t BITFLD_GP_ADC_LDO_LEVEL                  : 3;
};
#define GP_ADC_OFFS_SH_VREF                   (0x000F)
#define GP_ADC_LDO_LEVEL                      (0x0070)



#define GP_ADC_CLEAR_INT_REG                 (0x5000150E) /* General Purpose ADC Clear Interrupt Register */
#define GP_ADC_CLEAR_INT_REG_RESET           (0x00000000)

/*=============================*/
struct __GP_ADC_CLEAR_INT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_CLR_INT                    : 16;
};
#define GP_ADC_CLR_INT                        (0xFFFF)



#define GP_ADC_RESULT_REG                    (0x50001510) /* General Purpose ADC Result Register */
#define GP_ADC_RESULT_REG_RESET              (0x00000000)

/*=============================*/
struct __GP_ADC_RESULT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_VAL                        : 16;
};
#define GP_ADC_VAL                            (0xFFFF)



/*===========================================================================*/
/* memory map GPIO */
/*===========================================================================*/



#define P0_DATA_REG                          (0x50003000) /* P0 Data input/output Register */
#define P0_DATA_REG_RESET                    (0x00000000)

/*=============================*/
struct __P0_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P0_DATA                           : 12;
};
#define P0_DATA                               (0x0FFF)



#define P0_SET_DATA_REG                      (0x50003002) /* P0 Set port pins Register */
#define P0_SET_DATA_REG_RESET                (0x00000000)

/*=============================*/
struct __P0_SET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P0_SET                            : 12;
};
#define P0_SET                                (0x0FFF)



#define P0_RESET_DATA_REG                    (0x50003004) /* P0 Reset port pins Register */
#define P0_RESET_DATA_REG_RESET              (0x00000000)

/*=============================*/
struct __P0_RESET_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_P0_RESET                          : 12;
};
#define P0_RESET                              (0x0FFF)



#define P00_MODE_REG                         (0x50003006) /* P00 Mode Register */
#define P00_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P00_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P01_MODE_REG                         (0x50003008) /* P01 Mode Register */
#define P01_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P01_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P02_MODE_REG                         (0x5000300A) /* P02 Mode Register */
#define P02_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P02_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P03_MODE_REG                         (0x5000300C) /* P03 Mode Register */
#define P03_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P03_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



#define P04_MODE_REG                         (0x5000300E) /* P04 Mode Register */
#define P04_MODE_REG_RESET                   (0x00000200)

/*=============================*/
struct __P04_MODE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_PID                               : 5;
    volatile uint16_t                                          : 3;
    volatile uint16_t BITFLD_PUPD                              : 2;
};
#define PID                                   (0x001F)
#define PUPD                                  (0x0300)



