ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define CAL_PHASE                             (0x0001)



#define GP_CONTROL_REG                       (0x50003308) /* General purpose system control register. */
#define GP_CONTROL_REG_RESET                 (0x00000000)

/*=============================*/
struct __GP_CONTROL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BLE_WAKEUP_REQ                    : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_BLE_WAKEUP_LP_IRQ                 : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_CPU_DMA_BUS_PRIO                  : 1;
    volatile uint16_t BITFLD_BLE_TIMER_DATA_CTRL               : 2;
};
#define BLE_WAKEUP_REQ                        (0x0001)
#define BLE_WAKEUP_LP_IRQ                     (0x0004)
#define CPU_DMA_BUS_PRIO                      (0x0010)
#define BLE_TIMER_DATA_CTRL                   (0x0060)



#define BLE_TIMER_REG                        (0x5000330A) /* BLE FINECNT sampled value while in deep sleep state. */
#define BLE_TIMER_REG_RESET                  (0x00000000)

/*=============================*/
struct __BLE_TIMER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_BLE_TIMER_DATA                    : 10;
};
#define BLE_TIMER_DATA                        (0x03FF)



/*===========================================================================*/
/* memory map I2C */
/*===========================================================================*/



#define I2C_CON_REG                          (0x50001300) /* I2C Control Register */
#define I2C_CON_REG_RESET                    (0x0000007D)

/*=============================*/
struct __I2C_CON_REG
/*=============================*/
{
    volatile uint16_t BITFLD_I2C_MASTER_MODE                   : 1;
    volatile uint16_t BITFLD_I2C_SPEED                         : 2;
    volatile uint16_t BITFLD_I2C_10BITADDR_SLAVE               : 1;
    volatile uint16_t BITFLD_I2C_10BITADDR_MASTER              : 1;
    volatile uint16_t BITFLD_I2C_RESTART_EN                    : 1;
    volatile uint16_t BITFLD_I2C_SLAVE_DISABLE                 : 1;
};
#define I2C_MASTER_MODE                       (0x0001)
#define I2C_SPEED                             (0x0006)
#define I2C_10BITADDR_SLAVE                   (0x0008)
#define I2C_10BITADDR_MASTER                  (0x0010)
#define I2C_RESTART_EN                        (0x0020)
#define I2C_SLAVE_DISABLE                     (0x0040)



#define I2C_TAR_REG                          (0x50001304) /* I2C Target Address Register */
#define I2C_TAR_REG_RESET                    (0x00000055)

/*=============================*/
struct __I2C_TAR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_TAR                            : 10;
    volatile uint16_t BITFLD_GC_OR_START                       : 1;
    volatile uint16_t BITFLD_SPECIAL                           : 1;
};
#define IC_TAR                                (0x03FF)
#define GC_OR_START                           (0x0400)
#define SPECIAL                               (0x0800)



#define I2C_SAR_REG                          (0x50001308) /* I2C Slave Address Register */
#define I2C_SAR_REG_RESET                    (0x00000055)

/*=============================*/
struct __I2C_SAR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SAR                            : 10;
};
#define IC_SAR                                (0x03FF)



#define I2C_DATA_CMD_REG                     (0x50001310) /* I2C Rx/Tx Data Buffer and Command Register */
#define I2C_DATA_CMD_REG_RESET               (0x00000000)

/*=============================*/
struct __I2C_DATA_CMD_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DAT                               : 8;
    volatile uint16_t BITFLD_I2C_CMD                           : 1;
    volatile uint16_t BITFLD_I2C_STOP                          : 1;
    volatile uint16_t BITFLD_I2C_RESTART                       : 1;
};
#define DAT                                   (0x00FF)
#define I2C_CMD                               (0x0100)
#define I2C_STOP                              (0x0200)
#define I2C_RESTART                           (0x0400)



#define I2C_SS_SCL_HCNT_REG                  (0x50001314) /* Standard Speed I2C Clock SCL High Count Register */
#define I2C_SS_SCL_HCNT_REG_RESET            (0x00000048)

/*=============================*/
struct __I2C_SS_SCL_HCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SS_SCL_HCNT                    : 16;
};
#define IC_SS_SCL_HCNT                        (0xFFFF)



#define I2C_SS_SCL_LCNT_REG                  (0x50001318) /* Standard Speed I2C Clock SCL Low Count Register */
#define I2C_SS_SCL_LCNT_REG_RESET            (0x0000004F)

/*=============================*/
struct __I2C_SS_SCL_LCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SS_SCL_LCNT                    : 16;
};
#define IC_SS_SCL_LCNT                        (0xFFFF)



#define I2C_FS_SCL_HCNT_REG                  (0x5000131C) /* Fast Speed I2C Clock SCL High Count Register */
#define I2C_FS_SCL_HCNT_REG_RESET            (0x00000008)

/*=============================*/
struct __I2C_FS_SCL_HCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SCL_HCNT                    : 16;
};
#define IC_FS_SCL_HCNT                        (0xFFFF)



#define I2C_FS_SCL_LCNT_REG                  (0x50001320) /* Fast Speed I2C Clock SCL Low Count Register */
#define I2C_FS_SCL_LCNT_REG_RESET            (0x00000017)

/*=============================*/
struct __I2C_FS_SCL_LCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SCL_LCNT                    : 16;
};
#define IC_FS_SCL_LCNT                        (0xFFFF)



#define I2C_INTR_STAT_REG                    (0x5000132C) /* I2C Interrupt Status Register */
#define I2C_INTR_STAT_REG_RESET              (0x00000000)

/*=============================*/
struct __I2C_INTR_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_R_RX_UNDER                        : 1;
    volatile uint16_t BITFLD_R_RX_OVER                         : 1;
    volatile uint16_t BITFLD_R_RX_FULL                         : 1;
    volatile uint16_t BITFLD_R_TX_OVER                         : 1;
    volatile uint16_t BITFLD_R_TX_EMPTY                        : 1;
    volatile uint16_t BITFLD_R_RD_REQ                          : 1;
    volatile uint16_t BITFLD_R_TX_ABRT                         : 1;
    volatile uint16_t BITFLD_R_RX_DONE                         : 1;
    volatile uint16_t BITFLD_R_ACTIVITY                        : 1;
    volatile uint16_t BITFLD_R_STOP_DET                        : 1;
    volatile uint16_t BITFLD_R_START_DET                       : 1;
    volatile uint16_t BITFLD_R_GEN_CALL                        : 1;
};
#define R_RX_UNDER                            (0x0001)
#define R_RX_OVER                             (0x0002)
#define R_RX_FULL                             (0x0004)
#define R_TX_OVER                             (0x0008)
#define R_TX_EMPTY                            (0x0010)
#define R_RD_REQ                              (0x0020)
#define R_TX_ABRT                             (0x0040)
#define R_RX_DONE                             (0x0080)
#define R_ACTIVITY                            (0x0100)
#define R_STOP_DET                            (0x0200)
#define R_START_DET                           (0x0400)
#define R_GEN_CALL                            (0x0800)



#define I2C_INTR_MASK_REG                    (0x50001330) /* I2C Interrupt Mask Register */
#define I2C_INTR_MASK_REG_RESET              (0x000008FF)

/*=============================*/
struct __I2C_INTR_MASK_REG
/*=============================*/
{
    volatile uint16_t BITFLD_M_RX_UNDER                        : 1;
    volatile uint16_t BITFLD_M_RX_OVER                         : 1;
    volatile uint16_t BITFLD_M_RX_FULL                         : 1;
    volatile uint16_t BITFLD_M_TX_OVER                         : 1;
    volatile uint16_t BITFLD_M_TX_EMPTY                        : 1;
    volatile uint16_t BITFLD_M_RD_REQ                          : 1;
    volatile uint16_t BITFLD_M_TX_ABRT                         : 1;
    volatile uint16_t BITFLD_M_RX_DONE                         : 1;
    volatile uint16_t BITFLD_M_ACTIVITY                        : 1;
    volatile uint16_t BITFLD_M_STOP_DET                        : 1;
    volatile uint16_t BITFLD_M_START_DET                       : 1;
    volatile uint16_t BITFLD_M_GEN_CALL                        : 1;
};
#define M_RX_UNDER                            (0x0001)
#define M_RX_OVER                             (0x0002)
#define M_RX_FULL                             (0x0004)
#define M_TX_OVER                             (0x0008)
#define M_TX_EMPTY                            (0x0010)
#define M_RD_REQ                              (0x0020)
#define M_TX_ABRT                             (0x0040)
#define M_RX_DONE                             (0x0080)
#define M_ACTIVITY                            (0x0100)
#define M_STOP_DET                            (0x0200)
#define M_START_DET                           (0x0400)
#define M_GEN_CALL                            (0x0800)



#define I2C_RAW_INTR_STAT_REG                (0x50001334) /* I2C Raw Interrupt Status Register */
#define I2C_RAW_INTR_STAT_REG_RESET          (0x00000000)

/*=============================*/
struct __I2C_RAW_INTR_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RX_UNDER                          : 1;
    volatile uint16_t BITFLD_RX_OVER                           : 1;
    volatile uint16_t BITFLD_RX_FULL                           : 1;
    volatile uint16_t BITFLD_TX_OVER                           : 1;
    volatile uint16_t BITFLD_TX_EMPTY                          : 1;
    volatile uint16_t BITFLD_RD_REQ                            : 1;
    volatile uint16_t BITFLD_TX_ABRT                           : 1;
    volatile uint16_t BITFLD_RX_DONE                           : 1;
    volatile uint16_t BITFLD_ACTIVITY                          : 1;
    volatile uint16_t BITFLD_STOP_DET                          : 1;
    volatile uint16_t BITFLD_START_DET                         : 1;
    volatile uint16_t BITFLD_GEN_CALL                          : 1;
};
