ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define I2C_STATUS_REG                       (0x50001370) /* I2C Status Register */
#define I2C_STATUS_REG_RESET                 (0x00000006)

/*=============================*/
struct __I2C_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_I2C_ACTIVITY                      : 1;
    volatile uint16_t BITFLD_TFNF                              : 1;
    volatile uint16_t BITFLD_TFE                               : 1;
    volatile uint16_t BITFLD_RFNE                              : 1;
    volatile uint16_t BITFLD_RFF                               : 1;
    volatile uint16_t BITFLD_MST_ACTIVITY                      : 1;
    volatile uint16_t BITFLD_SLV_ACTIVITY                      : 1;
};
#define I2C_ACTIVITY                          (0x0001)
#define TFNF                                  (0x0002)
#define TFE                                   (0x0004)
#define RFNE                                  (0x0008)
#define RFF                                   (0x0010)
#define MST_ACTIVITY                          (0x0020)
#define SLV_ACTIVITY                          (0x0040)



#define I2C_TXFLR_REG                        (0x50001374) /* I2C Transmit FIFO Level Register */
#define I2C_TXFLR_REG_RESET                  (0x00000000)

/*=============================*/
struct __I2C_TXFLR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TXFLR                             : 6;
};
#define TXFLR                                 (0x003F)



#define I2C_RXFLR_REG                        (0x50001378) /* I2C Receive FIFO Level Register */
#define I2C_RXFLR_REG_RESET                  (0x00000000)

/*=============================*/
struct __I2C_RXFLR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RXFLR                             : 6;
};
#define RXFLR                                 (0x003F)



#define I2C_SDA_HOLD_REG                     (0x5000137C) /* I2C SDA Hold Time Length Register */
#define I2C_SDA_HOLD_REG_RESET               (0x00000001)

/*=============================*/
struct __I2C_SDA_HOLD_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_SDA_HOLD                       : 16;
};
#define IC_SDA_HOLD                           (0xFFFF)



#define I2C_TX_ABRT_SOURCE_REG               (0x50001380) /* I2C Transmit Abort Source Register */
#define I2C_TX_ABRT_SOURCE_REG_RESET         (0x00000000)

/*=============================*/
struct __I2C_TX_ABRT_SOURCE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ABRT_7B_ADDR_NOACK                : 1;
    volatile uint16_t BITFLD_ABRT_10ADDR1_NOACK                : 1;
    volatile uint16_t BITFLD_ABRT_10ADDR2_NOACK                : 1;
    volatile uint16_t BITFLD_ABRT_TXDATA_NOACK                 : 1;
    volatile uint16_t BITFLD_ABRT_GCALL_NOACK                  : 1;
    volatile uint16_t BITFLD_ABRT_GCALL_READ                   : 1;
    volatile uint16_t BITFLD_ABRT_HS_ACKDET                    : 1;
    volatile uint16_t BITFLD_ABRT_SBYTE_ACKDET                 : 1;
    volatile uint16_t BITFLD_ABRT_HS_NORSTRT                   : 1;
    volatile uint16_t BITFLD_ABRT_SBYTE_NORSTRT                : 1;
    volatile uint16_t BITFLD_ABRT_10B_RD_NORSTRT               : 1;
    volatile uint16_t BITFLD_ABRT_MASTER_DIS                   : 1;
    volatile uint16_t BITFLD_ARB_LOST                          : 1;
    volatile uint16_t BITFLD_ABRT_SLVFLUSH_TXFIFO              : 1;
    volatile uint16_t BITFLD_ABRT_SLV_ARBLOST                  : 1;
    volatile uint16_t BITFLD_ABRT_SLVRD_INTX                   : 1;
};
#define ABRT_7B_ADDR_NOACK                    (0x0001)
#define ABRT_10ADDR1_NOACK                    (0x0002)
#define ABRT_10ADDR2_NOACK                    (0x0004)
#define ABRT_TXDATA_NOACK                     (0x0008)
#define ABRT_GCALL_NOACK                      (0x0010)
#define ABRT_GCALL_READ                       (0x0020)
#define ABRT_HS_ACKDET                        (0x0040)
#define ABRT_SBYTE_ACKDET                     (0x0080)
#define ABRT_HS_NORSTRT                       (0x0100)
#define ABRT_SBYTE_NORSTRT                    (0x0200)
#define ABRT_10B_RD_NORSTRT                   (0x0400)
#define ABRT_MASTER_DIS                       (0x0800)
#define ARB_LOST                              (0x1000)
#define ABRT_SLVFLUSH_TXFIFO                  (0x2000)
#define ABRT_SLV_ARBLOST                      (0x4000)
#define ABRT_SLVRD_INTX                       (0x8000)



#define I2C_DMA_CR_REG                       (0x50001388) /* DMA Control Register */
#define I2C_DMA_CR_REG_RESET                 (0x00000000)

/*=============================*/
struct __I2C_DMA_CR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RDMAE                             : 1;
    volatile uint16_t BITFLD_TDMAE                             : 1;
};
#define RDMAE                                 (0x0001)
#define TDMAE                                 (0x0002)



#define I2C_DMA_TDLR_REG                     (0x5000138C) /* DMA Transmit Data Level Register */
#define I2C_DMA_TDLR_REG_RESET               (0x00000000)

/*=============================*/
struct __I2C_DMA_TDLR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMATDL                            : 5;
};
#define DMATDL                                (0x001F)



#define I2C_DMA_RDLR_REG                     (0x50001390) /* I2C Receive Data Level Register */
#define I2C_DMA_RDLR_REG_RESET               (0x00000000)

/*=============================*/
struct __I2C_DMA_RDLR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_DMARDL                            : 5;
};
#define DMARDL                                (0x001F)



#define I2C_SDA_SETUP_REG                    (0x50001394) /* I2C SDA Setup Register */
#define I2C_SDA_SETUP_REG_RESET              (0x00000064)

/*=============================*/
struct __I2C_SDA_SETUP_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SDA_SETUP                         : 8;
};
#define SDA_SETUP                             (0x00FF)



#define I2C_ACK_GENERAL_CALL_REG             (0x50001398) /* I2C ACK General Call Register */
#define I2C_ACK_GENERAL_CALL_REG_RESET       (0x00000000)

/*=============================*/
struct __I2C_ACK_GENERAL_CALL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ACK_GEN_CALL                      : 1;
};
#define ACK_GEN_CALL                          (0x0001)



#define I2C_ENABLE_STATUS_REG                (0x5000139C) /* I2C Enable Status Register */
#define I2C_ENABLE_STATUS_REG_RESET          (0x00000000)

/*=============================*/
struct __I2C_ENABLE_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_EN                             : 1;
    volatile uint16_t BITFLD_SLV_DISABLED_WHILE_BUSY           : 1;
    volatile uint16_t BITFLD_SLV_RX_DATA_LOST                  : 1;
};
#define IC_EN                                 (0x0001)
#define SLV_DISABLED_WHILE_BUSY               (0x0002)
#define SLV_RX_DATA_LOST                      (0x0004)



#define I2C_IC_FS_SPKLEN_REG                 (0x500013A0) /* I2C SS and FS spike suppression limit Size */
#define I2C_IC_FS_SPKLEN_REG_RESET           (0x00000001)

/*=============================*/
struct __I2C_IC_FS_SPKLEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_IC_FS_SPKLEN                      : 8;
};
#define IC_FS_SPKLEN                          (0x00FF)



