ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define GPIO_INT_LEVEL_CTRL_REG              (0x50001410) /* high or low level select for GPIO interrupts */
#define GPIO_INT_LEVEL_CTRL_REG_RESET        (0x00000000)

/*=============================*/
struct __GPIO_INT_LEVEL_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_INPUT_LEVEL0                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL1                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL2                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL3                      : 1;
    volatile uint16_t BITFLD_INPUT_LEVEL4                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn0                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn1                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn2                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn3                      : 1;
    volatile uint16_t BITFLD_EDGE_LEVELn4                      : 1;
};
#define INPUT_LEVEL0                          (0x0001)
#define INPUT_LEVEL1                          (0x0002)
#define INPUT_LEVEL2                          (0x0004)
#define INPUT_LEVEL3                          (0x0008)
#define INPUT_LEVEL4                          (0x0010)
#define EDGE_LEVELn0                          (0x0020)
#define EDGE_LEVELn1                          (0x0040)
#define EDGE_LEVELn2                          (0x0080)
#define EDGE_LEVELn3                          (0x0100)
#define EDGE_LEVELn4                          (0x0200)



#define KBRD_IRQ_IN_SEL0_REG                 (0x50001412) /* GPIO interrupt selection for KBRD_IRQ for P0 */
#define KBRD_IRQ_IN_SEL0_REG_RESET           (0x00000000)

/*=============================*/
struct __KBRD_IRQ_IN_SEL0_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KBRD_P00_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P01_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P02_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P03_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P04_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P05_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P06_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P07_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P08_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P09_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P10_EN                       : 1;
    volatile uint16_t BITFLD_KBRD_P11_EN                       : 1;
};
#define KBRD_P00_EN                           (0x0001)
#define KBRD_P01_EN                           (0x0002)
#define KBRD_P02_EN                           (0x0004)
#define KBRD_P03_EN                           (0x0008)
#define KBRD_P04_EN                           (0x0010)
#define KBRD_P05_EN                           (0x0020)
#define KBRD_P06_EN                           (0x0040)
#define KBRD_P07_EN                           (0x0080)
#define KBRD_P08_EN                           (0x0100)
#define KBRD_P09_EN                           (0x0200)
#define KBRD_P10_EN                           (0x0400)
#define KBRD_P11_EN                           (0x0800)



#define KBRD_CTRL_REG                        (0x50001414) /* GPIO Kbrd control register */
#define KBRD_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __KBRD_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_KEY_REPEAT                        : 6;
    volatile uint16_t BITFLD_KBRD_LEVEL                        : 1;
    volatile uint16_t BITFLD_KBRD_REL                          : 1;
};
#define KEY_REPEAT                            (0x003F)
#define KBRD_LEVEL                            (0x0040)
#define KBRD_REL                              (0x0080)



/*===========================================================================*/
/* memory map OTPC */
/*===========================================================================*/



#define OTPC_MODE_REG                        (0x07F40000) /* Mode register */
#define OTPC_MODE_REG_RESET                  (0x00000000)

/*=============================*/
struct __OTPC_MODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_MODE_MODE                    : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_MODE_USE_TST_ROW             : 1;
    volatile uint32_t BITFLD_OTPC_MODE_HT_MARG_EN              : 1;
    volatile uint32_t BITFLD_OTPC_MODE_PRG_SEL                 : 2;
};
#define OTPC_MODE_MODE                        (0x0007)
#define OTPC_MODE_USE_TST_ROW                 (0x0010)
#define OTPC_MODE_HT_MARG_EN                  (0x0020)
#define OTPC_MODE_PRG_SEL                     (0x00C0)



#define OTPC_STAT_REG                        (0x07F40004) /* Status register */
#define OTPC_STAT_REG_RESET                  (0x00000007)

/*=============================*/
struct __OTPC_STAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_STAT_PRDY                    : 1;
    volatile uint32_t BITFLD_OTPC_STAT_PBUF_EMPTY              : 1;
    volatile uint32_t BITFLD_OTPC_STAT_MRDY                    : 1;
};
#define OTPC_STAT_PRDY                        (0x0001)
#define OTPC_STAT_PBUF_EMPTY                  (0x0002)
#define OTPC_STAT_MRDY                        (0x0004)



#define OTPC_PADDR_REG                       (0x07F40008) /* The address of the word that will be programmed, when the PROG mode is used. */
#define OTPC_PADDR_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_PADDR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PADDR                        : 13;
};
#define OTPC_PADDR                            (0x1FFF)



#define OTPC_PWORD_REG                       (0x07F4000C) /* The 32-bit word that will be programmed, when the PROG mode is used. */
#define OTPC_PWORD_REG_RESET                 (0x00000000)

/*=============================*/
struct __OTPC_PWORD_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_PWORD                        : 32;
};
