ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define OTPC_PWORD                            (0xFFFFFFFF)



#define OTPC_TIM1_REG                        (0x07F40010) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM1_REG_RESET                  (0x0999000F)

/*=============================*/
struct __OTPC_TIM1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_1US                : 7;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_20NS               : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_OTPC_TIM1_CC_T_RD                 : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_PL                 : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_CS                 : 4;
    volatile uint32_t BITFLD_OTPC_TIM1_US_T_CSP                : 7;
};
#define OTPC_TIM1_CC_T_1US                    (0x007F)
#define OTPC_TIM1_CC_T_20NS                   (0x0300)
#define OTPC_TIM1_CC_T_RD                     (0x7000)
#define OTPC_TIM1_US_T_PL                     (0xF0000)
#define OTPC_TIM1_US_T_CS                     (0xF00000)
#define OTPC_TIM1_US_T_CSP                    (0x7F000000)



#define OTPC_TIM2_REG                        (0x07F40014) /* Various timing parameters of the OTP cell. */
#define OTPC_TIM2_REG_RESET                  (0xA4040409)

/*=============================*/
struct __OTPC_TIM2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PW                 : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PWI                : 3;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPR                : 7;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPS                : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_VDS                : 3;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_PPH                : 5;
    volatile uint32_t BITFLD_OTPC_TIM2_US_T_SAS                : 2;
    volatile uint32_t BITFLD_OTPC_TIM2_US_ADD_CC_EN            : 1;
};
#define OTPC_TIM2_US_T_PW                     (0x001F)
#define OTPC_TIM2_US_T_PWI                    (0x00E0)
#define OTPC_TIM2_US_T_PPR                    (0x7F00)
#define OTPC_TIM2_US_T_PPS                    (0x1F0000)
#define OTPC_TIM2_US_T_VDS                    (0xE00000)
#define OTPC_TIM2_US_T_PPH                    (0x1F000000)
#define OTPC_TIM2_US_T_SAS                    (0x60000000)
#define OTPC_TIM2_US_ADD_CC_EN                (0x80000000)



#define OTPC_AHBADR_REG                      (0x07F40018) /* AHB master start address */
#define OTPC_AHBADR_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_AHBADR_REG
/*=============================*/
{
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_OTPC_AHBADR                       : 14;
};
#define OTPC_AHBADR                           (0xFFFC)



#define OTPC_CELADR_REG                      (0x07F4001C) /* OTP cell start address */
#define OTPC_CELADR_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_CELADR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_CELADR                       : 13;
};
#define OTPC_CELADR                           (0x1FFF)



#define OTPC_NWORDS_REG                      (0x07F40020) /* Number of words */
#define OTPC_NWORDS_REG_RESET                (0x00000000)

/*=============================*/
struct __OTPC_NWORDS_REG
/*=============================*/
{
    volatile uint32_t BITFLD_OTPC_NWORDS                       : 13;
};
#define OTPC_NWORDS                           (0x1FFF)



/*===========================================================================*/
/* memory map PATCH */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map QDEC */
/*===========================================================================*/



#define QDEC_CTRL_REG                        (0x50000200) /* Quad Decoder control register */
#define QDEC_CTRL_REG_RESET                  (0x00000011)

/*=============================*/
struct __QDEC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_IRQ_ENABLE                   : 1;
    volatile uint16_t BITFLD_QDEC_EVENT_CNT_CLR                : 1;
    volatile uint16_t BITFLD_QDEC_IRQ_STATUS                   : 1;
    volatile uint16_t BITFLD_QDEC_IRQ_THRES                    : 8;
};
#define QDEC_IRQ_ENABLE                       (0x0001)
#define QDEC_EVENT_CNT_CLR                    (0x0002)
#define QDEC_IRQ_STATUS                       (0x0004)
#define QDEC_IRQ_THRES                        (0x07F8)



#define QDEC_XCNT_REG                        (0x50000202) /* Counter value of the X Axis */
#define QDEC_XCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_XCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_X_CNT                        : 16;
};
#define QDEC_X_CNT                            (0xFFFF)



#define QDEC_YCNT_REG                        (0x50000204) /* Counter value of the Y Axis */
#define QDEC_YCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_YCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_Y_CNT                        : 16;
};
#define QDEC_Y_CNT                            (0xFFFF)



#define QDEC_CLOCKDIV_REG                    (0x50000206) /* Clock divider register */
#define QDEC_CLOCKDIV_REG_RESET              (0x000003E7)

/*=============================*/
struct __QDEC_CLOCKDIV_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_CLOCKDIV                     : 10;
    volatile uint16_t BITFLD_QDEC_PRESCALER_EN                 : 1;
};
#define QDEC_CLOCKDIV                         (0x03FF)
#define QDEC_PRESCALER_EN                     (0x0400)



