ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define QDEC_CTRL2_REG                       (0x50000208) /* Quad Decoder port selection register */
#define QDEC_CTRL2_REG_RESET                 (0x00000ED1)

/*=============================*/
struct __QDEC_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_CHX_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHY_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHZ_PORT_SEL                 : 3;
    volatile uint16_t BITFLD_QDEC_CHX_EVENT_MODE               : 1;
    volatile uint16_t BITFLD_QDEC_CHY_EVENT_MODE               : 1;
    volatile uint16_t BITFLD_QDEC_CHZ_EVENT_MODE               : 1;
};
#define QDEC_CHX_PORT_SEL                     (0x0007)
#define QDEC_CHY_PORT_SEL                     (0x0038)
#define QDEC_CHZ_PORT_SEL                     (0x01C0)
#define QDEC_CHX_EVENT_MODE                   (0x0200)
#define QDEC_CHY_EVENT_MODE                   (0x0400)
#define QDEC_CHZ_EVENT_MODE                   (0x0800)



#define QDEC_ZCNT_REG                        (0x5000020A) /* Counter value of the Z Axis */
#define QDEC_ZCNT_REG_RESET                  (0x00000000)

/*=============================*/
struct __QDEC_ZCNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_Z_CNT                        : 16;
};
#define QDEC_Z_CNT                            (0xFFFF)



#define QDEC_EVENT_CNT_REG                   (0x5000020C) /* Event counter register */
#define QDEC_EVENT_CNT_REG_RESET             (0x00000000)

/*=============================*/
struct __QDEC_EVENT_CNT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_QDEC_EVENT_CNT                    : 8;
};
#define QDEC_EVENT_CNT                        (0x00FF)



/*===========================================================================*/
/* memory map RFCU */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map RFCU_POWER */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map RFMON */
/*===========================================================================*/
//reserved only



/*===========================================================================*/
/* memory map rtc2632_00 */
/*===========================================================================*/



#define RTC_CONTROL_REG                      (0x50004100) /* RTC Control Register */
#define RTC_CONTROL_REG_RESET                (0x00000003)

/*=============================*/
struct __RTC_CONTROL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_DISABLE                  : 1;
    volatile uint32_t BITFLD_RTC_CAL_DISABLE                   : 1;
};
#define RTC_TIME_DISABLE                      (0x0001)
#define RTC_CAL_DISABLE                       (0x0002)



#define RTC_HOUR_MODE_REG                    (0x50004104) /* RTC Hour Mode Register */
#define RTC_HOUR_MODE_REG_RESET              (0x00000000)

/*=============================*/
struct __RTC_HOUR_MODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_HMS                           : 1;
};
#define RTC_HMS                               (0x0001)



#define RTC_TIME_REG                         (0x50004108) /* RTC Time Register */
#define RTC_TIME_REG_RESET                   (0x00000000)

/*=============================*/
struct __RTC_TIME_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_H_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_H_T                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_T                      : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_M_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_M_T                      : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_HR_U                     : 4;
    volatile uint32_t BITFLD_RTC_TIME_HR_T                     : 2;
    volatile uint32_t BITFLD_RTC_TIME_PM                       : 1;
    volatile uint32_t BITFLD_RTC_TIME_CH                       : 1;
};
#define RTC_TIME_H_U                          (0x000F)
#define RTC_TIME_H_T                          (0x00F0)
#define RTC_TIME_S_U                          (0x0F00)
#define RTC_TIME_S_T                          (0x7000)
#define RTC_TIME_M_U                          (0xF0000)
#define RTC_TIME_M_T                          (0x700000)
#define RTC_TIME_HR_U                         (0xF000000)
#define RTC_TIME_HR_T                         (0x30000000)
#define RTC_TIME_PM                           (0x40000000)
#define RTC_TIME_CH                           (0x80000000)



#define RTC_CALENDAR_REG                     (0x5000410C) /* RTC Calendar Register */
#define RTC_CALENDAR_REG_RESET               (0x2000010F)

/*=============================*/
struct __RTC_CALENDAR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_DAY                           : 3;
    volatile uint32_t BITFLD_RTC_CAL_M_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_M_T                       : 1;
    volatile uint32_t BITFLD_RTC_CAL_D_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_D_T                       : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_RTC_CAL_Y_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_Y_T                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_C_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_C_T                       : 2;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_CAL_CH                        : 1;
};
#define RTC_DAY                               (0x0007)
#define RTC_CAL_M_U                           (0x0078)
#define RTC_CAL_M_T                           (0x0080)
#define RTC_CAL_D_U                           (0x0F00)
#define RTC_CAL_D_T                           (0x3000)
#define RTC_CAL_Y_U                           (0xF0000)
#define RTC_CAL_Y_T                           (0xF00000)
#define RTC_CAL_C_U                           (0xF000000)
#define RTC_CAL_C_T                           (0x30000000)
#define RTC_CAL_CH                            (0x80000000)



#define RTC_TIME_ALARM_REG                   (0x50004110) /* RTC Time Alarm Register */
#define RTC_TIME_ALARM_REG_RESET             (0x00000000)

/*=============================*/
struct __RTC_TIME_ALARM_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_TIME_H_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_H_T                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_S_T                      : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_M_U                      : 4;
    volatile uint32_t BITFLD_RTC_TIME_M_T                      : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RTC_TIME_HR_U                     : 4;
    volatile uint32_t BITFLD_RTC_TIME_HR_T                     : 2;
    volatile uint32_t BITFLD_RTC_TIME_PM                       : 1;
};
#define RTC_TIME_H_U                          (0x000F)
#define RTC_TIME_H_T                          (0x00F0)
#define RTC_TIME_S_U                          (0x0F00)
#define RTC_TIME_S_T                          (0x7000)
#define RTC_TIME_M_U                          (0xF0000)
#define RTC_TIME_M_T                          (0x700000)
#define RTC_TIME_HR_U                         (0xF000000)
#define RTC_TIME_HR_T                         (0x30000000)
#define RTC_TIME_PM                           (0x40000000)



#define RTC_CALENDAR_ALARM_REG               (0x50004114) /* RTC Calendar Alram Register */
#define RTC_CALENDAR_ALARM_REG_RESET         (0x00000000)

/*=============================*/
struct __RTC_CALENDAR_ALARM_REG
/*=============================*/
{
    volatile uint32_t                                          : 3;
    volatile uint32_t BITFLD_RTC_CAL_M_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_M_T                       : 1;
    volatile uint32_t BITFLD_RTC_CAL_D_U                       : 4;
    volatile uint32_t BITFLD_RTC_CAL_D_T                       : 2;
};
