ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RTC_VALID_TIME                        (0x0001)
#define RTC_VALID_CAL                         (0x0002)
#define RTC_VALID_TIME_ALM                    (0x0004)
#define RTC_VALID_CAL_ALM                     (0x0008)



#define RTC_KEEP_RTC_REG                     (0x50004130) /* RTC Keep RTC Register */
#define RTC_KEEP_RTC_REG_RESET               (0x00000001)

/*=============================*/
struct __RTC_KEEP_RTC_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_KEEP                          : 1;
};
#define RTC_KEEP                              (0x0001)



/*===========================================================================*/
/* memory map SPI */
/*===========================================================================*/



#define SPI_CTRL_REG                         (0x50001200) /* Spi control register */
#define SPI_CTRL_REG_RESET                   (0x00000000)

/*=============================*/
struct __SPI_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_EN                            : 1;
    volatile uint16_t BITFLD_SPI_TX_EN                         : 1;
    volatile uint16_t BITFLD_SPI_RX_EN                         : 1;
    volatile uint16_t BITFLD_SPI_DMA_TX_EN                     : 1;
    volatile uint16_t BITFLD_SPI_DMA_RX_EN                     : 1;
    volatile uint16_t BITFLD_SPI_FIFO_RESET                    : 1;
    volatile uint16_t BITFLD_SPI_CAPTURE_AT_NEXT_EDGE          : 1;
    volatile uint16_t BITFLD_SPI_SWAP_BYTES                    : 1;
};
#define SPI_EN                                (0x0001)
#define SPI_TX_EN                             (0x0002)
#define SPI_RX_EN                             (0x0004)
#define SPI_DMA_TX_EN                         (0x0008)
#define SPI_DMA_RX_EN                         (0x0010)
#define SPI_FIFO_RESET                        (0x0020)
#define SPI_CAPTURE_AT_NEXT_EDGE              (0x0040)
#define SPI_SWAP_BYTES                        (0x0080)



#define SPI_CONFIG_REG                       (0x50001204) /* Spi control register */
#define SPI_CONFIG_REG_RESET                 (0x00000000)

/*=============================*/
struct __SPI_CONFIG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_MODE                          : 2;
    volatile uint16_t BITFLD_SPI_WORD_LENGTH                   : 5;
    volatile uint16_t BITFLD_SPI_SLAVE_EN                      : 1;
};
#define SPI_MODE                              (0x0003)
#define SPI_WORD_LENGTH                       (0x007C)
#define SPI_SLAVE_EN                          (0x0080)



#define SPI_CLOCK_REG                        (0x50001208) /* Spi clock register */
#define SPI_CLOCK_REG_RESET                  (0x00000000)

/*=============================*/
struct __SPI_CLOCK_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_CLK_DIV                       : 7;
    volatile uint16_t BITFLD_SPI_MASTER_CLK_MODE               : 1;
};
#define SPI_CLK_DIV                           (0x007F)
#define SPI_MASTER_CLK_MODE                   (0x0080)



#define SPI_FIFO_CONFIG_REG                  (0x5000120C) /* Spi fifo configuration register */
#define SPI_FIFO_CONFIG_REG_RESET            (0x00000000)

/*=============================*/
struct __SPI_FIFO_CONFIG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_TX_TL                         : 4;
    volatile uint16_t BITFLD_SPI_RX_TL                         : 4;
};
#define SPI_TX_TL                             (0x000F)
#define SPI_RX_TL                             (0x00F0)



#define SPI_IRQ_MASK_REG                     (0x50001210) /* Spi interrupt mask register */
#define SPI_IRQ_MASK_REG_RESET               (0x00000000)

/*=============================*/
struct __SPI_IRQ_MASK_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_IRQ_MASK_TX_EMPTY             : 1;
    volatile uint16_t BITFLD_SPI_IRQ_MASK_RX_FULL              : 1;
};
#define SPI_IRQ_MASK_TX_EMPTY                 (0x0001)
#define SPI_IRQ_MASK_RX_FULL                  (0x0002)



#define SPI_STATUS_REG                       (0x50001214) /* Spi status register */
#define SPI_STATUS_REG_RESET                 (0x00000001)

/*=============================*/
struct __SPI_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_STATUS_TX_EMPTY               : 1;
    volatile uint16_t BITFLD_SPI_STATUS_RX_FULL                : 1;
};
#define SPI_STATUS_TX_EMPTY                   (0x0001)
#define SPI_STATUS_RX_FULL                    (0x0002)



#define SPI_FIFO_STATUS_REG                  (0x50001218) /* SPI RX/TX fifo status register */
#define SPI_FIFO_STATUS_REG_RESET            (0x00001000)

/*=============================*/
struct __SPI_FIFO_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_RX_FIFO_LEVEL                 : 6;
    volatile uint16_t BITFLD_SPI_TX_FIFO_LEVEL                 : 6;
    volatile uint16_t BITFLD_SPI_STATUS_RX_EMPTY               : 1;
    volatile uint16_t BITFLD_SPI_STATUS_TX_FULL                : 1;
    volatile uint16_t BITFLD_SPI_RX_FIFO_OVFL                  : 1;
    volatile uint16_t BITFLD_SPI_TRANSACTION_ACTIVE            : 1;
};
#define SPI_RX_FIFO_LEVEL                     (0x003F)
#define SPI_TX_FIFO_LEVEL                     (0x0FC0)
#define SPI_STATUS_RX_EMPTY                   (0x1000)
#define SPI_STATUS_TX_FULL                    (0x2000)
#define SPI_RX_FIFO_OVFL                      (0x4000)
#define SPI_TRANSACTION_ACTIVE                (0x8000)



#define SPI_FIFO_READ_REG                    (0x5000121C) /* Spi RX fifo read register */
#define SPI_FIFO_READ_REG_RESET              (0x00000000)

/*=============================*/
struct __SPI_FIFO_READ_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_FIFO_READ                     : 16;
};
#define SPI_FIFO_READ                         (0xFFFF)



#define SPI_FIFO_WRITE_REG                   (0x50001220) /* Spi TX fifo wtite register */
#define SPI_FIFO_WRITE_REG_RESET             (0x00000000)

/*=============================*/
struct __SPI_FIFO_WRITE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_FIFO_WRITE                    : 16;
};
#define SPI_FIFO_WRITE                        (0xFFFF)



#define SPI_CS_CONFIG_REG                    (0x50001224) /* Spi cs configuration register */
#define SPI_CS_CONFIG_REG_RESET              (0x00000000)

/*=============================*/
struct __SPI_CS_CONFIG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SPI_CS_SELECT                     : 3;
};
