ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define TIMER1_CAPCNT1_VALUE                  (0x07FF)
#define TIMER1_CAPCNT1_RTC_HIGH               (0x3FF800)



#define TIMER1_CAPCNT2_VALUE_REG             (0x50004010) /* Timer1 value for event on GPIO2 */
#define TIMER1_CAPCNT2_VALUE_REG_RESET       (0x00000000)

/*=============================*/
struct __TIMER1_CAPCNT2_VALUE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_CAPCNT2_VALUE              : 11;
    volatile uint32_t BITFLD_TIMER1_CAPCNT2_RTC_HIGH           : 11;
};
#define TIMER1_CAPCNT2_VALUE                  (0x07FF)
#define TIMER1_CAPCNT2_RTC_HIGH               (0x3FF800)



#define TIMER1_CLR_EVENT_REG                 (0x50004014) /* Clear event register */
#define TIMER1_CLR_EVENT_REG_RESET           (0x00000000)

/*=============================*/
struct __TIMER1_CLR_EVENT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TIMER1_CLR_TIMER_EVENT            : 1;
    volatile uint32_t BITFLD_TIMER1_CLR_IN1_EVENT              : 1;
    volatile uint32_t BITFLD_TIMER1_CLR_IN2_EVENT              : 1;
};
#define TIMER1_CLR_TIMER_EVENT                (0x0001)
#define TIMER1_CLR_IN1_EVENT                  (0x0002)
#define TIMER1_CLR_IN2_EVENT                  (0x0004)



/*===========================================================================*/
/* memory map UART */
/*===========================================================================*/



#define UART_RBR_THR_DLL_REG                 (0x50001000) /* Receive Buffer Register/Transmit Holding Register/Divisor Latch Low */
#define UART_RBR_THR_DLL_REG_RESET           (0x00000000)

/*=============================*/
struct __UART_RBR_THR_DLL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RBR_THR_DLL                       : 8;
};
#define RBR_THR_DLL                           (0x00FF)



#define UART_IER_DLH_REG                     (0x50001004) /* Interrupt Enable Register/Divisor Latch High */
#define UART_IER_DLH_REG_RESET               (0x00000000)

/*=============================*/
struct __UART_IER_DLH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ERBFI_dlh0                        : 1;
    volatile uint16_t BITFLD_ETBEI_dlh1                        : 1;
    volatile uint16_t BITFLD_ELSI_dhl2                         : 1;
    volatile uint16_t BITFLD_EDSSI_dlh3                        : 1;
    volatile uint16_t BITFLD_dlh6_4                            : 3;
    volatile uint16_t BITFLD_PTIME_dlh7                        : 1;
};
#define ERBFI_dlh0                            (0x0001)
#define ETBEI_dlh1                            (0x0002)
#define ELSI_dhl2                             (0x0004)
#define EDSSI_dlh3                            (0x0008)
#define dlh6_4                                (0x0070)
#define PTIME_dlh7                            (0x0080)



#define UART_IIR_FCR_REG                     (0x50001008) /* Interrupt Identification Register/FIFO Control Register */
#define UART_IIR_FCR_REG_RESET               (0x00000001)

/*=============================*/
struct __UART_IIR_FCR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_IID0_FIFOE                   : 1;
    volatile uint16_t BITFLD_UART_IID1_RFIFOE                  : 1;
    volatile uint16_t BITFLD_UART_IID2_XFIFOR                  : 1;
    volatile uint16_t BITFLD_UART_IID3_DMAM                    : 1;
    volatile uint16_t BITFLD_UART_TET                          : 2;
    volatile uint16_t BITFLD_UART_FIFOSE_RT                    : 2;
};
#define UART_IID0_FIFOE                       (0x0001)
#define UART_IID1_RFIFOE                      (0x0002)
#define UART_IID2_XFIFOR                      (0x0004)
#define UART_IID3_DMAM                        (0x0008)
#define UART_TET                              (0x0030)
#define UART_FIFOSE_RT                        (0x00C0)



#define UART_LCR_REG                         (0x5000100C) /* Line Control Register */
#define UART_LCR_REG_RESET                   (0x00000000)

/*=============================*/
struct __UART_LCR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DLS                          : 2;
    volatile uint16_t BITFLD_UART_STOP                         : 1;
    volatile uint16_t BITFLD_UART_PEN                          : 1;
    volatile uint16_t BITFLD_UART_EPS                          : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_UART_BC                           : 1;
    volatile uint16_t BITFLD_UART_DLAB                         : 1;
};
#define UART_DLS                              (0x0003)
#define UART_STOP                             (0x0004)
#define UART_PEN                              (0x0008)
#define UART_EPS                              (0x0010)
#define UART_BC                               (0x0040)
#define UART_DLAB                             (0x0080)



#define UART_MCR_REG                         (0x50001010) /* Modem Control Register */
#define UART_MCR_REG_RESET                   (0x00000000)

/*=============================*/
struct __UART_MCR_REG
/*=============================*/
{
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_UART_RTS                          : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_UART_LB                           : 1;
    volatile uint16_t BITFLD_UART_AFCE                         : 1;
    volatile uint16_t                                          : 1;
};
#define UART_RTS                              (0x0002)
#define UART_LB                               (0x0010)
#define UART_AFCE                             (0x0020)



#define UART_LSR_REG                         (0x50001014) /* Line Status Register */
#define UART_LSR_REG_RESET                   (0x00000060)

/*=============================*/
struct __UART_LSR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_UART_DR                           : 1;
    volatile uint16_t BITFLD_UART_OE                           : 1;
    volatile uint16_t BITFLD_UART_PE                           : 1;
    volatile uint16_t BITFLD_UART_FE                           : 1;
    volatile uint16_t BITFLD_UART_BI                           : 1;
    volatile uint16_t BITFLD_UART_THRE                         : 1;
    volatile uint16_t BITFLD_UART_TEMT                         : 1;
    volatile uint16_t BITFLD_UART_RFE                          : 1;
};
