ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define UCV                                   (0xFFFF)



#define UART2_CTR_REG                        (0x500011FC) /* Component Type Register */
#define UART2_CTR_REG_RESET                  (0x00000110)

/*=============================*/
struct __UART2_CTR_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



#define UART2_CTR_HIGH_REG                   (0x500011FE) /* Component Type Register */
#define UART2_CTR_HIGH_REG_RESET             (0x00004457)

/*=============================*/
struct __UART2_CTR_HIGH_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CTR                               : 16;
};
#define CTR                                   (0xFFFF)



/*===========================================================================*/
/* memory map Version */
/*===========================================================================*/



#define CHIP_ID1_REG                         (0x50003200) /* Chip identification register 1. */
#define CHIP_ID1_REG_RESET                   (0x00000032)

/*=============================*/
struct __CHIP_ID1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID1                          : 8;
};
#define CHIP_ID1                              (0x00FF)



#define CHIP_ID2_REG                         (0x50003204) /* Chip identification register 2. */
#define CHIP_ID2_REG_RESET                   (0x00000036)

/*=============================*/
struct __CHIP_ID2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID2                          : 8;
};
#define CHIP_ID2                              (0x00FF)



#define CHIP_ID3_REG                         (0x50003208) /* Chip identification register 3. */
#define CHIP_ID3_REG_RESET                   (0x00000033)

/*=============================*/
struct __CHIP_ID3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID3                          : 8;
};
#define CHIP_ID3                              (0x00FF)



#define CHIP_ID4_REG                         (0x5000320C) /* Chip identification register 4. */
#define CHIP_ID4_REG_RESET                   (0x00000032)

/*=============================*/
struct __CHIP_ID4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_ID4                          : 8;
};
#define CHIP_ID4                              (0x00FF)



#define CHIP_SWC_REG                         (0x50003210) /* Software compatibility register. */
#define CHIP_SWC_REG_RESET                   (0x00000000)

/*=============================*/
struct __CHIP_SWC_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_SWC                          : 4;
};
#define CHIP_SWC                              (0x000F)



#define CHIP_REVISION_REG                    (0x50003214) /* Chip revision register. */
#define CHIP_REVISION_REG_RESET              (0x00000041)

/*=============================*/
struct __CHIP_REVISION_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_REVISION                     : 8;
};
#define CHIP_REVISION                         (0x00FF)



#define CHIP_TEST1_REG                       (0x500032F8) /* Chip test register 1. */
#define CHIP_TEST1_REG_RESET                 (0x00000043)

/*=============================*/
struct __CHIP_TEST1_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_LAYOUT_REVISION              : 8;
};
#define CHIP_LAYOUT_REVISION                  (0x00FF)



#define CHIP_TEST2_REG                       (0x500032FC) /* Chip test register 2. */
#define CHIP_TEST2_REG_RESET                 (0x00000000)

/*=============================*/
struct __CHIP_TEST2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_CHIP_METAL_OPTION                 : 4;
};
#define CHIP_METAL_OPTION                     (0x000F)



/*===========================================================================*/
/* memory map WDOG */
/*===========================================================================*/



#define WATCHDOG_REG                         (0x50003100) /* Watchdog timer register. */
#define WATCHDOG_REG_RESET                   (0x000000FF)

/*=============================*/
struct __WATCHDOG_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WDOG_VAL                          : 8;
    volatile uint16_t BITFLD_WDOG_VAL_NEG                      : 1;
    volatile uint16_t BITFLD_WDOG_WEN                          : 7;
};
#define WDOG_VAL                              (0x00FF)
#define WDOG_VAL_NEG                          (0x0100)
#define WDOG_WEN                              (0xFE00)



#define WATCHDOG_CTRL_REG                    (0x50003102) /* Watchdog control register. */
#define WATCHDOG_CTRL_REG_RESET              (0x00000000)

/*=============================*/
struct __WATCHDOG_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_NMI_RST                           : 1;
    volatile uint16_t                                          : 1;
};
#define NMI_RST                               (0x0001)



/*===========================================================================*/
/* memory map WKUP */
/*===========================================================================*/



#define WKUP_CTRL_REG                        (0x50000100) /* Control register for the wakeup counter */
#define WKUP_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __WKUP_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_DEB_VALUE                    : 6;
    volatile uint16_t BITFLD_WKUP_SFT_KEYHIT                   : 1;
    volatile uint16_t BITFLD_WKUP_ENABLE_IRQ                   : 1;
    volatile uint16_t BITFLD_WKUP2_ENABLE_IRQ                  : 1;
};
#define WKUP_DEB_VALUE                        (0x003F)
#define WKUP_SFT_KEYHIT                       (0x0040)
#define WKUP_ENABLE_IRQ                       (0x0080)
#define WKUP2_ENABLE_IRQ                      (0x0100)



#define WKUP_COMPARE_REG                     (0x50000102) /* Number of events before wakeup interrupt */
#define WKUP_COMPARE_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COMPARE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_COMPARE                      : 8;
};
#define WKUP_COMPARE                          (0x00FF)



#define WKUP_IRQ_STATUS_REG                  (0x50000104) /* Reset wakeup interrupt */
#define WKUP_IRQ_STATUS_REG_RESET            (0x00000000)

/*=============================*/
struct __WKUP_IRQ_STATUS_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_IRQ_STATUS                   : 1;
    volatile uint16_t BITFLD_WKUP2_IRQ_STATUS                  : 1;
    volatile uint16_t BITFLD_WKUP_CNTR_RST                     : 1;
    volatile uint16_t BITFLD_WKUP2_CNTR_RST                    : 1;
};
#define WKUP_IRQ_STATUS                       (0x0001)
#define WKUP2_IRQ_STATUS                      (0x0002)
#define WKUP_CNTR_RST                         (0x0004)
#define WKUP2_CNTR_RST                        (0x0008)



#define WKUP_COUNTER_REG                     (0x50000106) /* Actual number of events of the wakeup counter */
#define WKUP_COUNTER_REG_RESET               (0x00000000)

/*=============================*/
struct __WKUP_COUNTER_REG
/*=============================*/
{
    volatile uint16_t BITFLD_EVENT_VALUE                       : 8;
    volatile uint16_t BITFLD_EVENT2_VALUE                      : 8;
};
#define EVENT_VALUE                           (0x00FF)
#define EVENT2_VALUE                          (0xFF00)



#define WKUP_SELECT_GPIO_REG                 (0x50000108) /* Select which inputs from P0 port can trigger wkup counter */
#define WKUP_SELECT_GPIO_REG_RESET           (0x00000000)

/*=============================*/
struct __WKUP_SELECT_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP_SELECT_GPIO                  : 12;
};
#define WKUP_SELECT_GPIO                      (0x0FFF)



#define WKUP2_SELECT_GPIO_REG                (0x5000010A) /* Select which inputs from P1 port can trigger wkup counter */
#define WKUP2_SELECT_GPIO_REG_RESET          (0x00000000)

/*=============================*/
struct __WKUP2_SELECT_GPIO_REG
/*=============================*/
{
    volatile uint16_t BITFLD_WKUP2_SELECT_GPIO                 : 12;
};
#define WKUP2_SELECT_GPIO                     (0x0FFF)



