ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RF_LDO_VREF_SEL_REG                  (0x40001058)
#define RF_LDO_VREF_SEL_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_LDO_VREF_SEL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_LDO_RADIO_VREF_SEL             : 1;
    volatile uint32_t BITFLD_RF_LDO_DTC_VREF_SEL               : 1;
    volatile uint32_t BITFLD_RF_LDO_DCO_VREF_SEL               : 1;
};
#define RF_LDO_RADIO_VREF_SEL                 (0x0001)
#define RF_LDO_DTC_VREF_SEL                   (0x0002)
#define RF_LDO_DCO_VREF_SEL                   (0x0004)



#define RF_MIXER_CTRL1_REG                   (0x40001064)
#define RF_MIXER_CTRL1_REG_RESET             (0x010F010F)

/*=============================*/
struct __RF_MIXER_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIXER_IP2_DAC_I_TRIM              : 9;
    volatile uint32_t                                          : 7;
    volatile uint32_t BITFLD_MIXER_IP2_DAC_Q_TRIM              : 9;
};
#define MIXER_IP2_DAC_I_TRIM                  (0x01FF)
#define MIXER_IP2_DAC_Q_TRIM                  (0x1FF0000)



#define RF_MIXER_CTRL2_REG                   (0x40001068)
#define RF_MIXER_CTRL2_REG_RESET             (0x00000000)

/*=============================*/
struct __RF_MIXER_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_CAL_CAP_WR_1M                 : 4;
    volatile uint32_t                                          : 4;
    volatile uint32_t BITFLD_MIX_CAL_CAP_WR_2M                 : 4;
    volatile uint32_t                                          : 4;
    volatile uint32_t BITFLD_MIX_CAL_SELECT                    : 1;
};
#define MIX_CAL_CAP_WR_1M                     (0x000F)
#define MIX_CAL_CAP_WR_2M                     (0x0F00)
#define MIX_CAL_SELECT                        (0x10000)



#define RF_IO_CTRL_REG                       (0x40001074)
#define RF_IO_CTRL_REG_RESET                 (0x00000100)

/*=============================*/
struct __RF_IO_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_TUNE_CAP_TRIM_RX             : 4;
    volatile uint32_t                                          : 4;
    volatile uint32_t BITFLD_RFIO_TUNE_CAP_TRIM_TX             : 4;
};
#define RFIO_TUNE_CAP_TRIM_RX                 (0x000F)
#define RFIO_TUNE_CAP_TRIM_TX                 (0x0F00)



#define RF_LNA_CTRL1_REG                     (0x40001078)
#define RF_LNA_CTRL1_REG_RESET               (0x01084210)

/*=============================*/
struct __RF_LNA_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_TRIM_GAIN0_HP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN1_HP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN2_HP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN3_HP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN4_HP                 : 5;
};
#define LNA_TRIM_GAIN0_HP                     (0x001F)
#define LNA_TRIM_GAIN1_HP                     (0x03E0)
#define LNA_TRIM_GAIN2_HP                     (0x7C00)
#define LNA_TRIM_GAIN3_HP                     (0xF8000)
#define LNA_TRIM_GAIN4_HP                     (0x1F00000)



#define RF_LNA_CTRL2_REG                     (0x4000107C)
#define RF_LNA_CTRL2_REG_RESET               (0x00D6B5AD)

/*=============================*/
struct __RF_LNA_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_TRIM_GAIN0_LP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN1_LP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN2_LP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN3_LP                 : 5;
    volatile uint32_t BITFLD_LNA_TRIM_GAIN4_LP                 : 5;
};
#define LNA_TRIM_GAIN0_LP                     (0x001F)
#define LNA_TRIM_GAIN1_LP                     (0x03E0)
#define LNA_TRIM_GAIN2_LP                     (0x7C00)
#define LNA_TRIM_GAIN3_LP                     (0xF8000)
#define LNA_TRIM_GAIN4_LP                     (0x1F00000)



#define RF_LNA_CTRL3_REG                     (0x40001080)
#define RF_LNA_CTRL3_REG_RESET               (0x00111114)

/*=============================*/
struct __RF_LNA_CTRL3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_TRIM_CASC                     : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_LNA_MODE_GAIN0_LP                 : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_LNA_MODE_GAIN1_LP                 : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_LNA_MODE_GAIN2_LP                 : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_LNA_MODE_GAIN3_LP                 : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_LNA_MODE_GAIN4_LP                 : 2;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_LNA_SPARE                         : 2;
};
#define LNA_TRIM_CASC                         (0x0007)
#define LNA_MODE_GAIN0_LP                     (0x0030)
#define LNA_MODE_GAIN1_LP                     (0x0300)
#define LNA_MODE_GAIN2_LP                     (0x3000)
#define LNA_MODE_GAIN3_LP                     (0x30000)
#define LNA_MODE_GAIN4_LP                     (0x300000)
#define LNA_SPARE                             (0x3000000)



#define RF_ADPLLDIG_RFMON_CTRL_REG           (0x400010A0)
#define RF_ADPLLDIG_RFMON_CTRL_REG_RESET     (0x00000001)

/*=============================*/
struct __RF_ADPLLDIG_RFMON_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_SYNC_CLK_INV             : 1;
    volatile uint32_t BITFLD_ADPLLDIG_RFMON_MUX_SEL            : 3;
    volatile uint32_t BITFLD_ADPLLDIG_RFMON_SPARE              : 4;
};
#define ADPLLDIG_SYNC_CLK_INV                 (0x0001)
#define ADPLLDIG_RFMON_MUX_SEL                (0x000E)
#define ADPLLDIG_RFMON_SPARE                  (0x00F0)



#define RF_RDP_CTRL_REG                      (0x400010A4)
#define RF_RDP_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_RDP_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RDP_RFCU_SEL                      : 1;
    volatile uint32_t BITFLD_RDP_MOD_SEL1                      : 1;
    volatile uint32_t BITFLD_RDP_MOD_SEL2                      : 2;
    volatile uint32_t BITFLD_RDP_MOD_RATE                      : 2;
};
#define RDP_RFCU_SEL                          (0x0001)
#define RDP_MOD_SEL1                          (0x0002)
#define RDP_MOD_SEL2                          (0x000C)
#define RDP_MOD_RATE                          (0x0030)



#define RF_RFCU_CTRL_REG                     (0x400010A8)
#define RF_RFCU_CTRL_REG_RESET               (0x00000001)

/*=============================*/
struct __RF_RFCU_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RF_RFCU_CLK_DIV                   : 1;
};
#define RF_RFCU_CLK_DIV                       (0x0001)



#define RF_OVERRULE_REG                      (0x400010AC)
#define RF_OVERRULE_REG_RESET                (0x00000000)

/*=============================*/
struct __RF_OVERRULE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TX_EN_OVR                         : 2;
    volatile uint32_t BITFLD_RX_EN_OVR                         : 2;
};
