ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define TX_EN_OVR                             (0x0003)
#define RX_EN_OVR                             (0x000C)



#define RF_DIAGIRQ_CTRL_REG                  (0x400010B0)
#define RF_DIAGIRQ_CTRL_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAG_BUS0_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS0_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS0_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS0_EDGE_SEL                : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS1_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS1_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS1_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS1_EDGE_SEL                : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS2_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS2_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS2_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS2_EDGE_SEL                : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DIAG_BUS3_IRQ_MASK                : 1;
    volatile uint32_t BITFLD_DIAG_BUS3_SEL                     : 2;
    volatile uint32_t BITFLD_DIAG_BUS3_BIT_SEL                 : 3;
    volatile uint32_t BITFLD_DIAG_BUS3_EDGE_SEL                : 1;
};
#define DIAG_BUS0_IRQ_MASK                    (0x0001)
#define DIAG_BUS0_SEL                         (0x0006)
#define DIAG_BUS0_BIT_SEL                     (0x0038)
#define DIAG_BUS0_EDGE_SEL                    (0x0040)
#define DIAG_BUS1_IRQ_MASK                    (0x0100)
#define DIAG_BUS1_SEL                         (0x0600)
#define DIAG_BUS1_BIT_SEL                     (0x3800)
#define DIAG_BUS1_EDGE_SEL                    (0x4000)
#define DIAG_BUS2_IRQ_MASK                    (0x10000)
#define DIAG_BUS2_SEL                         (0x60000)
#define DIAG_BUS2_BIT_SEL                     (0x380000)
#define DIAG_BUS2_EDGE_SEL                    (0x400000)
#define DIAG_BUS3_IRQ_MASK                    (0x1000000)
#define DIAG_BUS3_SEL                         (0x6000000)
#define DIAG_BUS3_BIT_SEL                     (0x38000000)
#define DIAG_BUS3_EDGE_SEL                    (0x40000000)



#define RF_DIAGIRQ_STAT_REG                  (0x400010B4)
#define RF_DIAGIRQ_STAT_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DIAGIRQ_STAT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DIAGIRQ_STAT                      : 4;
};
#define DIAGIRQ_STAT                          (0x000F)



#define RF_LDO_CTRL_REG                      (0x400010B8)
#define RF_LDO_CTRL_REG_RESET                (0x00190333)

/*=============================*/
struct __RF_LDO_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LDO_RADIO_LEVEL                   : 3;
    volatile uint32_t BITFLD_LDO_RADIO_CONT_ENABLE             : 1;
    volatile uint32_t BITFLD_LDO_DTC_LEVEL                     : 3;
    volatile uint32_t BITFLD_LDO_DTC_CONT_ENABLE               : 1;
    volatile uint32_t BITFLD_LDO_DCO_LEVEL                     : 3;
    volatile uint32_t BITFLD_LDO_DCO_CONT_ENABLE               : 1;
    volatile uint32_t                                          : 4;
    volatile uint32_t BITFLD_LDO_VREF_SMPL_TIME                : 5;
    volatile uint32_t                                          : 3;
    volatile uint32_t BITFLD_LDO_RADIO_HOLD_OVR_VAL            : 1;
    volatile uint32_t BITFLD_LDO_RADIO_HOLD_OVR_EN             : 1;
    volatile uint32_t BITFLD_LDO_DTC_HOLD_OVR_VAL              : 1;
    volatile uint32_t BITFLD_LDO_DTC_HOLD_OVR_EN               : 1;
    volatile uint32_t BITFLD_LDO_DCO_HOLD_OVR_VAL              : 1;
    volatile uint32_t BITFLD_LDO_DCO_HOLD_OVR_EN               : 1;
};
#define LDO_RADIO_LEVEL                       (0x0007)
#define LDO_RADIO_CONT_ENABLE                 (0x0008)
#define LDO_DTC_LEVEL                         (0x0070)
#define LDO_DTC_CONT_ENABLE                   (0x0080)
#define LDO_DCO_LEVEL                         (0x0700)
#define LDO_DCO_CONT_ENABLE                   (0x0800)
#define LDO_VREF_SMPL_TIME                    (0x1F0000)
#define LDO_RADIO_HOLD_OVR_VAL                (0x1000000)
#define LDO_RADIO_HOLD_OVR_EN                 (0x2000000)
#define LDO_DTC_HOLD_OVR_VAL                  (0x4000000)
#define LDO_DTC_HOLD_OVR_EN                   (0x8000000)
#define LDO_DCO_HOLD_OVR_VAL                  (0x10000000)
#define LDO_DCO_HOLD_OVR_EN                   (0x20000000)



#define RF_ENABLE_CONFIG0_REG                (0x40001200)
#define RF_ENABLE_CONFIG0_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG0_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RFIO_LDO_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_RFIO_LDO_EN_DCF_TX                : 5;
};
#define RFIO_LDO_EN_DCF_RX                    (0x001F)
#define RFIO_LDO_EN_DCF_TX                    (0x03E0)



#define RF_ENABLE_CONFIG1_REG                (0x40001204)
#define RF_ENABLE_CONFIG1_REG_RESET          (0x00000083)

/*=============================*/
struct __RF_ENABLE_CONFIG1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PA_LDO_EN_DCF_RX                  : 5;
    volatile uint32_t BITFLD_PA_LDO_EN_DCF_TX                  : 5;
};
#define PA_LDO_EN_DCF_RX                      (0x001F)
#define PA_LDO_EN_DCF_TX                      (0x03E0)



#define RF_ENABLE_CONFIG2_REG                (0x40001208)
#define RF_ENABLE_CONFIG2_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_LDO_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_LNA_LDO_EN_DCF_TX                 : 5;
};
#define LNA_LDO_EN_DCF_RX                     (0x001F)
#define LNA_LDO_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG3_REG                (0x4000120C)
#define RF_ENABLE_CONFIG3_REG_RESET          (0x00000003)

/*=============================*/
struct __RF_ENABLE_CONFIG3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_LDO_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_MIX_LDO_EN_DCF_TX                 : 5;
};
#define MIX_LDO_EN_DCF_RX                     (0x001F)
#define MIX_LDO_EN_DCF_TX                     (0x03E0)



