ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RF_ENABLE_CONFIG19_REG               (0x4000124C)
#define RF_ENABLE_CONFIG19_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG19_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PA_EN_DCF_RX                      : 5;
    volatile uint32_t BITFLD_PA_EN_DCF_TX                      : 5;
};
#define PA_EN_DCF_RX                          (0x001F)
#define PA_EN_DCF_TX                          (0x03E0)



#define RF_ENABLE_CONFIG20_REG               (0x40001250)
#define RF_ENABLE_CONFIG20_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG20_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_CORE_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_LNA_CORE_EN_DCF_TX                : 5;
};
#define LNA_CORE_EN_DCF_RX                    (0x001F)
#define LNA_CORE_EN_DCF_TX                    (0x03E0)



#define RF_ENABLE_CONFIG21_REG               (0x40001254)
#define RF_ENABLE_CONFIG21_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_LNA_CGM_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_LNA_CGM_EN_DCF_TX                 : 5;
};
#define LNA_CGM_EN_DCF_RX                     (0x001F)
#define LNA_CGM_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG22_REG               (0x40001258)
#define RF_ENABLE_CONFIG22_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG22_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_MIX_EN_DCF_TX                     : 5;
};
#define MIX_EN_DCF_RX                         (0x001F)
#define MIX_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG23_REG               (0x4000125C)
#define RF_ENABLE_CONFIG23_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG23_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MIX_BIAS_SH_OPEN_DCF_RX           : 5;
    volatile uint32_t BITFLD_MIX_BIAS_SH_OPEN_DCF_TX           : 5;
};
#define MIX_BIAS_SH_OPEN_DCF_RX               (0x001F)
#define MIX_BIAS_SH_OPEN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG24_REG               (0x40001260)
#define RF_ENABLE_CONFIG24_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG24_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFF_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_IFF_EN_DCF_TX                     : 5;
};
#define IFF_EN_DCF_RX                         (0x001F)
#define IFF_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG25_REG               (0x40001264)
#define RF_ENABLE_CONFIG25_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG25_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IFF_BIAS_SH_OPEN_DCF_RX           : 5;
    volatile uint32_t BITFLD_IFF_BIAS_SH_OPEN_DCF_TX           : 5;
};
#define IFF_BIAS_SH_OPEN_DCF_RX               (0x001F)
#define IFF_BIAS_SH_OPEN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG26_REG               (0x40001268)
#define RF_ENABLE_CONFIG26_REG_RESET         (0x0000000F)

/*=============================*/
struct __RF_ENABLE_CONFIG26_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_CLK_EN_DCF_RX                 : 5;
    volatile uint32_t BITFLD_ADC_CLK_EN_DCF_TX                 : 5;
};
#define ADC_CLK_EN_DCF_RX                     (0x001F)
#define ADC_CLK_EN_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG27_REG               (0x4000126C)
#define RF_ENABLE_CONFIG27_REG_RESET         (0x00000010)

/*=============================*/
struct __RF_ENABLE_CONFIG27_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADC_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_ADC_EN_DCF_TX                     : 5;
};
#define ADC_EN_DCF_RX                         (0x001F)
#define ADC_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG28_REG               (0x40001270)
#define RF_ENABLE_CONFIG28_REG_RESET         (0x00000041)

/*=============================*/
struct __RF_ENABLE_CONFIG28_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_DCO_EN_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLL_DCO_EN_DCF_TX               : 5;
};
#define ADPLL_DCO_EN_DCF_RX                   (0x001F)
#define ADPLL_DCO_EN_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG29_REG               (0x40001274)
#define RF_ENABLE_CONFIG29_REG_RESET         (0x00000041)

/*=============================*/
struct __RF_ENABLE_CONFIG29_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_CLK_EN_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLL_CLK_EN_DCF_TX               : 5;
};
#define ADPLL_CLK_EN_DCF_RX                   (0x001F)
#define ADPLL_CLK_EN_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG30_REG               (0x40001278)
#define RF_ENABLE_CONFIG30_REG_RESET         (0x00000107)

/*=============================*/
struct __RF_ENABLE_CONFIG30_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_RST_DCF_RX               : 5;
    volatile uint32_t BITFLD_ADPLLDIG_RST_DCF_TX               : 5;
};
#define ADPLLDIG_RST_DCF_RX                   (0x001F)
#define ADPLLDIG_RST_DCF_TX                   (0x03E0)



#define RF_ENABLE_CONFIG31_REG               (0x4000127C)
#define RF_ENABLE_CONFIG31_REG_RESET         (0x00000149)

/*=============================*/
struct __RF_ENABLE_CONFIG31_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_EN_DCF_RX                : 5;
    volatile uint32_t BITFLD_ADPLLDIG_EN_DCF_TX                : 5;
};
#define ADPLLDIG_EN_DCF_RX                    (0x001F)
#define ADPLLDIG_EN_DCF_TX                    (0x03E0)



