ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RF_ENABLE_CONFIG32_REG               (0x40001280)
#define RF_ENABLE_CONFIG32_REG_RESET         (0x00000001)

/*=============================*/
struct __RF_ENABLE_CONFIG32_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_RX_EN_DCF_RX             : 5;
    volatile uint32_t BITFLD_ADPLLDIG_RX_EN_DCF_TX             : 5;
};
#define ADPLLDIG_RX_EN_DCF_RX                 (0x001F)
#define ADPLLDIG_RX_EN_DCF_TX                 (0x03E0)



#define RF_ENABLE_CONFIG33_REG               (0x40001284)
#define RF_ENABLE_CONFIG33_REG_RESET         (0x000001E0)

/*=============================*/
struct __RF_ENABLE_CONFIG33_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLLDIG_PAIN_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_ADPLLDIG_PAIN_EN_DCF_TX           : 5;
};
#define ADPLLDIG_PAIN_EN_DCF_RX               (0x001F)
#define ADPLLDIG_PAIN_EN_DCF_TX               (0x03E0)



#define RF_ENABLE_CONFIG34_REG               (0x40001288)
#define RF_ENABLE_CONFIG34_REG_RESET         (0x000001C0)

/*=============================*/
struct __RF_ENABLE_CONFIG34_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_LOBUF_PA_EN_DCF_RX          : 5;
    volatile uint32_t BITFLD_ADPLL_LOBUF_PA_EN_DCF_TX          : 5;
};
#define ADPLL_LOBUF_PA_EN_DCF_RX              (0x001F)
#define ADPLL_LOBUF_PA_EN_DCF_TX              (0x03E0)



#define RF_ENABLE_CONFIG35_REG               (0x4000128C)
#define RF_ENABLE_CONFIG35_REG_RESET         (0x00000294)

/*=============================*/
struct __RF_ENABLE_CONFIG35_REG
/*=============================*/
{
    volatile uint32_t BITFLD_CAL_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_CAL_EN_DCF_TX                     : 5;
};
#define CAL_EN_DCF_RX                         (0x001F)
#define CAL_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG36_REG               (0x40001290)
#define RF_ENABLE_CONFIG36_REG_RESET         (0x00000011)

/*=============================*/
struct __RF_ENABLE_CONFIG36_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_EN_DCF_RX                     : 5;
    volatile uint32_t BITFLD_DEM_EN_DCF_TX                     : 5;
};
#define DEM_EN_DCF_RX                         (0x001F)
#define DEM_EN_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG37_REG               (0x40001294)
#define RF_ENABLE_CONFIG37_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG37_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_DC_PARCAL_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_SPARE_DEM_DC_PARCAL_DCF_TX        : 5;
};
#define DEM_DC_PARCAL_EN_DCF_RX               (0x001F)
#define SPARE_DEM_DC_PARCAL_DCF_TX            (0x03E0)



#define RF_ENABLE_CONFIG38_REG               (0x40001298)
#define RF_ENABLE_CONFIG38_REG_RESET         (0x00000011)

/*=============================*/
struct __RF_ENABLE_CONFIG38_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_AGC_UNFREEZE_EN_DCF_RX        : 5;
    volatile uint32_t BITFLD_SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX  : 5;
};
#define DEM_AGC_UNFREEZE_EN_DCF_RX            (0x001F)
#define SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX      (0x03E0)



#define RF_ENABLE_CONFIG39_REG               (0x4000129C)
#define RF_ENABLE_CONFIG39_REG_RESET         (0x00000013)

/*=============================*/
struct __RF_ENABLE_CONFIG39_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_SIGDETECT_EN_DCF_RX           : 5;
    volatile uint32_t BITFLD_SPARE_DEM_SIGDETECT_EN_DCF_TX     : 5;
};
#define DEM_SIGDETECT_EN_DCF_RX               (0x001F)
#define SPARE_DEM_SIGDETECT_EN_DCF_TX         (0x03E0)



#define RF_ENABLE_CONFIG40_REG               (0x400012A0)
#define RF_ENABLE_CONFIG40_REG_RESET         (0x00000253)

/*=============================*/
struct __RF_ENABLE_CONFIG40_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PHY_RDY4BS_DCF_RX                 : 5;
    volatile uint32_t BITFLD_PHY_RDY4BS_DCF_TX                 : 5;
};
#define PHY_RDY4BS_DCF_RX                     (0x001F)
#define PHY_RDY4BS_DCF_TX                     (0x03E0)



#define RF_ENABLE_CONFIG41_REG               (0x400012A4)
#define RF_ENABLE_CONFIG41_REG_RESET         (0x000000C5)

/*=============================*/
struct __RF_ENABLE_CONFIG41_REG
/*=============================*/
{
    volatile uint32_t BITFLD_ADPLL_RDY_FOR_DIV_DCF_RX          : 5;
    volatile uint32_t BITFLD_ADPLL_RDY_FOR_DIV_DCF_TX          : 5;
};
#define ADPLL_RDY_FOR_DIV_DCF_RX              (0x001F)
#define ADPLL_RDY_FOR_DIV_DCF_TX              (0x03E0)



#define RF_ENABLE_CONFIG42_REG               (0x400012A8)
#define RF_ENABLE_CONFIG42_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG42_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE1_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE1_DCF_TX                     : 5;
};
#define SPARE1_DCF_RX                         (0x001F)
#define SPARE1_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG43_REG               (0x400012AC)
#define RF_ENABLE_CONFIG43_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG43_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE2_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE2_DCF_TX                     : 5;
};
#define SPARE2_DCF_RX                         (0x001F)
#define SPARE2_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG44_REG               (0x400012B0)
#define RF_ENABLE_CONFIG44_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG44_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE3_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE3_DCF_TX                     : 5;
};
#define SPARE3_DCF_RX                         (0x001F)
#define SPARE3_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG45_REG               (0x400012B4)
#define RF_ENABLE_CONFIG45_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG45_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE4_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE4_DCF_TX                     : 5;
};
#define SPARE4_DCF_RX                         (0x001F)
#define SPARE4_DCF_TX                         (0x03E0)



#define RF_ENABLE_CONFIG46_REG               (0x400012B8)
#define RF_ENABLE_CONFIG46_REG_RESET         (0x00000000)

/*=============================*/
struct __RF_ENABLE_CONFIG46_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SPARE5_DCF_RX                     : 5;
    volatile uint32_t BITFLD_SPARE5_DCF_TX                     : 5;
};
#define SPARE5_DCF_RX                         (0x001F)
#define SPARE5_DCF_TX                         (0x03E0)



#define RF_CNTRL_TIMER_1_REG                 (0x40001300)
#define RF_CNTRL_TIMER_1_REG_RESET           (0x00000400)

/*=============================*/
struct __RF_CNTRL_TIMER_1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
