ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_15_REG                (0x40001338)
#define RF_CNTRL_TIMER_15_REG_RESET          (0x00000426)

/*=============================*/
struct __RF_CNTRL_TIMER_15_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_16_REG                (0x4000133C)
#define RF_CNTRL_TIMER_16_REG_RESET          (0x00000430)

/*=============================*/
struct __RF_CNTRL_TIMER_16_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_17_REG                (0x40001340)
#define RF_CNTRL_TIMER_17_REG_RESET          (0x00000837)

/*=============================*/
struct __RF_CNTRL_TIMER_17_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_18_REG                (0x40001344)
#define RF_CNTRL_TIMER_18_REG_RESET          (0x00000846)

/*=============================*/
struct __RF_CNTRL_TIMER_18_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_19_REG                (0x40001348)
#define RF_CNTRL_TIMER_19_REG_RESET          (0x00000850)

/*=============================*/
struct __RF_CNTRL_TIMER_19_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_20_REG                (0x4000134C)
#define RF_CNTRL_TIMER_20_REG_RESET          (0x0000125A)

/*=============================*/
struct __RF_CNTRL_TIMER_20_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_21_REG                (0x40001350)
#define RF_CNTRL_TIMER_21_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_21_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_22_REG                (0x40001354)
#define RF_CNTRL_TIMER_22_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_22_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_23_REG                (0x40001358)
#define RF_CNTRL_TIMER_23_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_23_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_24_REG                (0x4000135C)
#define RF_CNTRL_TIMER_24_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_24_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_25_REG                (0x40001360)
#define RF_CNTRL_TIMER_25_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_25_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_26_REG                (0x40001364)
#define RF_CNTRL_TIMER_26_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_26_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
#define SET_OFFSET                            (0x00FF)
#define RESET_OFFSET                          (0xFF00)



#define RF_CNTRL_TIMER_27_REG                (0x40001368)
#define RF_CNTRL_TIMER_27_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_CNTRL_TIMER_27_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SET_OFFSET                        : 8;
    volatile uint32_t BITFLD_RESET_OFFSET                      : 8;
};
