ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RF_DEM_ATTR_REG                      (0x4000203C)
#define RF_DEM_ATTR_REG_RESET                (0x00C4A18F)

/*=============================*/
struct __RF_DEM_ATTR_REG
/*=============================*/
{
    volatile uint32_t BITFLD_AFC_POLE1                         : 2;
    volatile uint32_t BITFLD_AFC_POLE2                         : 2;
    volatile uint32_t BITFLD_RXDATA_INV                        : 1;
    volatile uint32_t BITFLD_DEM_HSI_POL                       : 1;
    volatile uint32_t BITFLD_MATCH0101_TH                      : 4;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_AGC_SPEED8M_EN                    : 1;
    volatile uint32_t BITFLD_DCOC_SPEED8M_EN                   : 1;
    volatile uint32_t BITFLD_DCPOLE                            : 2;
    volatile uint32_t BITFLD_RSSI_TH                           : 6;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_RFADC_CLK_PHASE                   : 2;
    volatile uint32_t BITFLD_ADDR_TIMEOUT_X2                   : 1;
};
#define AFC_POLE1                             (0x0003)
#define AFC_POLE2                             (0x000C)
#define RXDATA_INV                            (0x0010)
#define DEM_HSI_POL                           (0x0020)
#define MATCH0101_TH                          (0x03C0)
#define AGC_SPEED8M_EN                        (0x0800)
#define DCOC_SPEED8M_EN                       (0x1000)
#define DCPOLE                                (0x6000)
#define RSSI_TH                               (0x1F8000)
#define RFADC_CLK_PHASE                       (0xC00000)
#define ADDR_TIMEOUT_X2                       (0x1000000)



#define RF_RSSI_COMP_CTRL_REG                (0x40002040)
#define RF_RSSI_COMP_CTRL_REG_RESET          (0x00088888)

/*=============================*/
struct __RF_RSSI_COMP_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RSSI_COMP0                        : 4;
    volatile uint32_t BITFLD_RSSI_COMP1                        : 4;
    volatile uint32_t BITFLD_RSSI_COMP2                        : 4;
    volatile uint32_t BITFLD_RSSI_COMP3                        : 4;
    volatile uint32_t BITFLD_RSSI_COMP4                        : 4;
};
#define RSSI_COMP0                            (0x000F)
#define RSSI_COMP1                            (0x00F0)
#define RSSI_COMP2                            (0x0F00)
#define RSSI_COMP3                            (0xF000)
#define RSSI_COMP4                            (0xF0000)



#define RF_DEM_TESTMODE_REG                  (0x40002044)
#define RF_DEM_TESTMODE_REG_RESET            (0x00000000)

/*=============================*/
struct __RF_DEM_TESTMODE_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DEM_RFMON_SOURCE                  : 4;
    volatile uint32_t BITFLD_DEM_GPADC_MUX_SEL                 : 3;
    volatile uint32_t BITFLD_DEM_RFMON_TRIGGER                 : 2;
};
#define DEM_RFMON_SOURCE                      (0x000F)
#define DEM_GPADC_MUX_SEL                     (0x0070)
#define DEM_RFMON_TRIGGER                     (0x0180)



#define RF_DEM_IQCORRECT_REG                 (0x40002048)
#define RF_DEM_IQCORRECT_REG_RESET           (0x00000000)

/*=============================*/
struct __RF_DEM_IQCORRECT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_IQCORR_BETA                       : 8;
    volatile uint32_t BITFLD_IQCORR_ALPHA                      : 8;
};
#define IQCORR_BETA                           (0x00FF)
#define IQCORR_ALPHA                          (0xFF00)



#define RF_PAD_CNT_CTRL_REG                  (0x4000204C)
#define RF_PAD_CNT_CTRL_REG_RESET            (0x00004000)

/*=============================*/
struct __RF_PAD_CNT_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PAD_POS_LIMIT                     : 7;
    volatile uint32_t BITFLD_PAD_NEG_LIMIT                     : 7;
    volatile uint32_t BITFLD_PAD_CLEAR_COUNT                   : 1;
};
#define PAD_POS_LIMIT                         (0x007F)
#define PAD_NEG_LIMIT                         (0x3F80)
#define PAD_CLEAR_COUNT                       (0x4000)



#define RF_PAD_CNT_RESULT_REG                (0x40002050)
#define RF_PAD_CNT_RESULT_REG_RESET          (0x00000000)

/*=============================*/
struct __RF_PAD_CNT_RESULT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PAD_POS_CNT_RD                    : 8;
    volatile uint32_t BITFLD_PAD_NEG_CNT_RD                    : 8;
};
#define PAD_POS_CNT_RD                        (0x00FF)
#define PAD_NEG_CNT_RD                        (0xFF00)



#define RF_DC_OFFSET_RESULT_REG              (0x40002058)
#define RF_DC_OFFSET_RESULT_REG_RESET        (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_RESULT_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define RF_DC_OFFSET_FULL_RES_REG            (0x4000205C)
#define RF_DC_OFFSET_FULL_RES_REG_RESET      (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_FULL_RES_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define RF_DC_OFFSET_MPAR_RES0_REG           (0x40002060)
#define RF_DC_OFFSET_MPAR_RES0_REG_RESET     (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_MPAR_RES0_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define RF_DC_OFFSET_MPAR_RES1_REG           (0x40002064)
#define RF_DC_OFFSET_MPAR_RES1_REG_RESET     (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_MPAR_RES1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define RF_DC_OFFSET_MPAR_RES2_REG           (0x40002068)
#define RF_DC_OFFSET_MPAR_RES2_REG_RESET     (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_MPAR_RES2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define RF_DC_OFFSET_MPAR_RES3_REG           (0x4000206C)
#define RF_DC_OFFSET_MPAR_RES3_REG_RESET     (0x00000000)

/*=============================*/
struct __RF_DC_OFFSET_MPAR_RES3_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOFFSET_I_RD                     : 9;
    volatile uint32_t BITFLD_DCOFFSET_Q_RD                     : 9;
};
#define DCOFFSET_I_RD                         (0x01FF)
#define DCOFFSET_Q_RD                         (0x3FE00)



#define ADPLL_ATTR_CTRL_REG                  (0x40003000)
#define ADPLL_ATTR_CTRL_REG_RESET            (0x00000003)

/*=============================*/
struct __ADPLL_ATTR_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_PWR_MODE_RX                       : 1;
    volatile uint32_t BITFLD_PWR_MODE_TX                       : 1;
};
