ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define ADPLL_TXMOD_CTRL_REG                 (0x40003024)
#define ADPLL_TXMOD_CTRL_REG_RESET           (0x00000000)

/*=============================*/
struct __ADPLL_TXMOD_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_BT_SEL                            : 1;
    volatile uint32_t BITFLD_TX_DATA_INV                       : 1;
    volatile uint32_t BITFLD_MOD_INDEX                         : 2;
    volatile uint32_t BITFLD_EO_PACKET_DIS                     : 1;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_TX_MODE                           : 2;
    volatile uint32_t BITFLD_INV_CKMODEXT                      : 1;
};
#define BT_SEL                                (0x0001)
#define TX_DATA_INV                           (0x0002)
#define MOD_INDEX                             (0x000C)
#define EO_PACKET_DIS                         (0x0010)
#define TX_MODE                               (0x00C0)
#define INV_CKMODEXT                          (0x0100)



#define ADPLL_SDMOD_CTRL_REG                 (0x40003028)
#define ADPLL_SDMOD_CTRL_REG_RESET           (0x00000039)

/*=============================*/
struct __ADPLL_SDMOD_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_SDMMODERX                         : 3;
    volatile uint32_t BITFLD_SDMMODETX                         : 3;
};
#define SDMMODERX                             (0x0007)
#define SDMMODETX                             (0x0038)



#define ADPLL_LF_CTRL1_REG                   (0x4000302C)
#define ADPLL_LF_CTRL1_REG_RESET             (0x0000818C)

/*=============================*/
struct __ADPLL_LF_CTRL1_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FINETAU                           : 5;
    volatile uint32_t BITFLD_FINEK                             : 5;
    volatile uint32_t BITFLD_FINEKZ                            : 6;
};
#define FINETAU                               (0x001F)
#define FINEK                                 (0x03E0)
#define FINEKZ                                (0xFC00)



#define ADPLL_LF_CTRL2_REG                   (0x40003030)
#define ADPLL_LF_CTRL2_REG_RESET             (0x1CA2879E)

/*=============================*/
struct __ADPLL_LF_CTRL2_REG
/*=============================*/
{
    volatile uint32_t BITFLD_MODTAU_TUNE                       : 6;
    volatile uint32_t BITFLD_MODK_TUNE                         : 6;
    volatile uint32_t BITFLD_MODTAU                            : 6;
    volatile uint32_t BITFLD_MODK                              : 6;
    volatile uint32_t BITFLD_MODKZ                             : 6;
    volatile uint32_t BITFLD_RST_TAU_EN                        : 1;
};
#define MODTAU_TUNE                           (0x003F)
#define MODK_TUNE                             (0x0FC0)
#define MODTAU                                (0x3F000)
#define MODK                                  (0xFC0000)
#define MODKZ                                 (0x3F000000)
#define RST_TAU_EN                            (0x40000000)



#define ADPLL_ANA_CTRL_REG                   (0x40003034)
#define ADPLL_ANA_CTRL_REG_RESET             (0x0215807B)

/*=============================*/
struct __ADPLL_ANA_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TDC_DTCIN_EN                      : 1;
    volatile uint32_t BITFLD_TDC_CKVIN_EN                      : 1;
    volatile uint32_t BITFLD_TDC_INV                           : 1;
    volatile uint32_t BITFLD_INV_CKTDC                         : 1;
    volatile uint32_t BITFLD_INV_CKPHV                         : 1;
    volatile uint32_t BITFLD_INV_CKDCOMOD                      : 1;
    volatile uint32_t BITFLD_EN_CKDCOMOD                       : 1;
    volatile uint32_t BITFLD_TGLDETEN                          : 1;
    volatile uint32_t BITFLD_DTCOFFSET                         : 7;
    volatile uint32_t BITFLD_DTC_EN                            : 1;
    volatile uint32_t BITFLD_TDC_OFFSET                        : 6;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_VPASETTLE                         : 2;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DTC_LDO_DMY                       : 2;
};
#define TDC_DTCIN_EN                          (0x0001)
#define TDC_CKVIN_EN                          (0x0002)
#define TDC_INV                               (0x0004)
#define INV_CKTDC                             (0x0008)
#define INV_CKPHV                             (0x0010)
#define INV_CKDCOMOD                          (0x0020)
#define EN_CKDCOMOD                           (0x0040)
#define TGLDETEN                              (0x0080)
#define DTCOFFSET                             (0x7F00)
#define DTC_EN                                (0x8000)
#define TDC_OFFSET                            (0x3F0000)
#define VPASETTLE                             (0x3000000)
#define DTC_LDO_DMY                           (0x18000000)



#define ADPLL_DIV_CTRL_REG                   (0x40003038)
#define ADPLL_DIV_CTRL_REG_RESET             (0x0198FF03)

/*=============================*/
struct __ADPLL_DIV_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_FBDIV_EN                          : 1;
    volatile uint32_t BITFLD_RXDIV_FB_EN_RX                    : 1;
    volatile uint32_t BITFLD_RXDIV_FB_EN_TX                    : 1;
    volatile uint32_t                                          : 5;
    volatile uint32_t BITFLD_RXDIV_TRIM                        : 9;
    volatile uint32_t BITFLD_TXDIV_TRIM                        : 9;
};
#define FBDIV_EN                              (0x0001)
#define RXDIV_FB_EN_RX                        (0x0002)
#define RXDIV_FB_EN_TX                        (0x0004)
#define RXDIV_TRIM                            (0x1FF00)
#define TXDIV_TRIM                            (0x3FE0000)



#define ADPLL_INIT_CTRL_REG                  (0x4000303C)
#define ADPLL_INIT_CTRL_REG_RESET            (0x00000005)

/*=============================*/
struct __ADPLL_INIT_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_DCOCOARSEIC                       : 4;
    volatile uint32_t BITFLD_DCOMEDIUMIC                       : 3;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_DCOFINEIC                         : 6;
    volatile uint32_t                                          : 2;
    volatile uint32_t BITFLD_DCOMODIC                          : 13;
};
#define DCOCOARSEIC                           (0x000F)
#define DCOMEDIUMIC                           (0x0070)
#define DCOFINEIC                             (0x3F00)
#define DCOMODIC                              (0x1FFF0000)



#define ADPLL_FSM_CTRL_REG                   (0x40003040)
#define ADPLL_FSM_CTRL_REG_RESET             (0x08F8AE84)

/*=============================*/
struct __ADPLL_FSM_CTRL_REG
/*=============================*/
{
    volatile uint32_t BITFLD_TCOARSE                           : 4;
    volatile uint32_t BITFLD_TMEDIUM                           : 4;
    volatile uint32_t BITFLD_TFINE                             : 4;
    volatile uint32_t BITFLD_TMOD                              : 4;
    volatile uint32_t BITFLD_TPASETTLE                         : 4;
    volatile uint32_t BITFLD_TSETTLE                           : 4;
    volatile uint32_t BITFLD_TVPASETTLE                        : 6;
};
