ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define PATCH_ADDR4_REG                      (0x40080040)
#define PATCH_ADDR4_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR4_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR5_REG                      (0x40080048)
#define PATCH_ADDR5_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR5_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR6_REG                      (0x40080050)
#define PATCH_ADDR6_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR6_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR7_REG                      (0x40080058)
#define PATCH_ADDR7_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR7_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR8_REG                      (0x40080060)
#define PATCH_ADDR8_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR8_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR9_REG                      (0x40080068)
#define PATCH_ADDR9_REG_RESET                (0x07F00000)

/*=============================*/
struct __PATCH_ADDR9_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR10_REG                     (0x40080070)
#define PATCH_ADDR10_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR10_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR11_REG                     (0x40080078)
#define PATCH_ADDR11_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR11_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR12_REG                     (0x40080080)
#define PATCH_ADDR12_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR12_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



#define PATCH_ADDR13_REG                     (0x40080088)
#define PATCH_ADDR13_REG_RESET               (0x07F00000)

/*=============================*/
struct __PATCH_ADDR13_REG
/*=============================*/
{
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_C                      : 17;
    volatile uint32_t                                          : 1;
    volatile uint32_t BITFLD_PATCH_ADDR_19                     : 1;
};
#define PATCH_ADDR_C                          (0x3FFFE)
#define PATCH_ADDR_19                         (0x80000)



