ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define POWER_AON_CTRL_REG                   (0x50000320) /*  */
#define POWER_AON_CTRL_REG_RESET             (0x00000008)

/*=============================*/
struct __POWER_AON_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_VBAT_HL_CONNECT_RES_CTRL          : 2;
    volatile uint16_t BITFLD_POR_VBAT_LOW_RST_MASK             : 1;
    volatile uint16_t BITFLD_POR_VBAT_HIGH_RST_MASK            : 1;
    volatile uint16_t BITFLD_RC32K_HIGH_SPEED_FORCE            : 1;
    volatile uint16_t BITFLD_RC32K_LOW_SPEED_FORCE             : 1;
    volatile uint16_t BITFLD_CHARGE_VBAT_DISABLE               : 1;
    volatile uint16_t BITFLD_BOOST_MODE_FORCE                  : 2;
    volatile uint16_t BITFLD_CMP_VCONT_SLP_DISABLE             : 1;
    volatile uint16_t BITFLD_LDO_RET_TRIM                      : 4;
    volatile uint16_t BITFLD_FORCE_RUNNING_COMP_DIS            : 1;
};
#define VBAT_HL_CONNECT_RES_CTRL              (0x0003)
#define POR_VBAT_LOW_RST_MASK                 (0x0004)
#define POR_VBAT_HIGH_RST_MASK                (0x0008)
#define RC32K_HIGH_SPEED_FORCE                (0x0010)
#define RC32K_LOW_SPEED_FORCE                 (0x0020)
#define CHARGE_VBAT_DISABLE                   (0x0040)
#define BOOST_MODE_FORCE                      (0x0180)
#define CMP_VCONT_SLP_DISABLE                 (0x0200)
#define LDO_RET_TRIM                          (0x3C00)
#define FORCE_RUNNING_COMP_DIS                (0x4000)



#define GP_DATA_REG                          (0x50000324) /*  */
#define GP_DATA_REG_RESET                    (0x00000000)

/*=============================*/
struct __GP_DATA_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SW_GP_DATA                        : 4;
    volatile uint16_t BITFLD_DISABLE_CLAMP_OVERRULE            : 1;
    volatile uint16_t BITFLD_ANA_SPARE                         : 3;
};
#define SW_GP_DATA                            (0x000F)
#define DISABLE_CLAMP_OVERRULE                (0x0010)
#define ANA_SPARE                             (0x00E0)



#define TEST_VDD_REG                         (0x500003F0)
#define TEST_VDD_REG_RESET                   (0x00000000)

/*=============================*/
struct __TEST_VDD_REG
/*=============================*/
{
    volatile uint16_t BITFLD_TEST_VDD                          : 1;
    volatile uint16_t BITFLD_LDOS_DISABLE                      : 1;
};
#define TEST_VDD                              (0x0001)
#define LDOS_DISABLE                          (0x0002)



#define GP_ADC_CTRL_REG                      (0x50001500) /* General Purpose ADC Control Register */
#define GP_ADC_CTRL_REG_RESET                (0x00000000)

/*=============================*/
struct __GP_ADC_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_EN                         : 1;
    volatile uint16_t BITFLD_GP_ADC_START                      : 1;
    volatile uint16_t BITFLD_GP_ADC_CONT                       : 1;
    volatile uint16_t BITFLD_GP_ADC_DMA_EN                     : 1;
    volatile uint16_t BITFLD_GP_ADC_INT                        : 1;
    volatile uint16_t BITFLD_GP_ADC_MINT                       : 1;
    volatile uint16_t BITFLD_GP_ADC_SE                         : 1;
    volatile uint16_t BITFLD_GP_ADC_MUTE                       : 1;
    volatile uint16_t BITFLD_GP_ADC_SIGN                       : 1;
    volatile uint16_t BITFLD_GP_ADC_CHOP                       : 1;
    volatile uint16_t BITFLD_GP_ADC_LDO_HOLD                   : 1;
    volatile uint16_t BITFLD_GP_ADC_OFFS_SH_GAIN_SEL           : 1;
    volatile uint16_t BITFLD_DIE_TEMP_EN                       : 1;
};
#define GP_ADC_EN                             (0x0001)
#define GP_ADC_START                          (0x0002)
#define GP_ADC_CONT                           (0x0004)
#define GP_ADC_DMA_EN                         (0x0008)
#define GP_ADC_INT                            (0x0010)
#define GP_ADC_MINT                           (0x0020)
#define GP_ADC_SE                             (0x0040)
#define GP_ADC_MUTE                           (0x0080)
#define GP_ADC_SIGN                           (0x0100)
#define GP_ADC_CHOP                           (0x0200)
#define GP_ADC_LDO_HOLD                       (0x0400)
#define GP_ADC_OFFS_SH_GAIN_SEL               (0x0800)
#define DIE_TEMP_EN                           (0x1000)



#define GP_ADC_SEL_REG                       (0x50001506) /* General Purpose ADC Input Selection Register */
#define GP_ADC_SEL_REG_RESET                 (0x00000000)

/*=============================*/
struct __GP_ADC_SEL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_GP_ADC_SEL_N                      : 3;
    volatile uint16_t BITFLD_GP_ADC_SEL_N_TST                  : 1;
    volatile uint16_t BITFLD_GP_ADC_SEL_P                      : 3;
    volatile uint16_t BITFLD_GP_ADC_SEL_P_TST                  : 1;
};
#define GP_ADC_SEL_N                          (0x0007)
#define GP_ADC_SEL_N_TST                      (0x0008)
#define GP_ADC_SEL_P                          (0x0070)
#define GP_ADC_SEL_P_TST                      (0x0080)



#define GP_ADC_PARAM_DIF_REG                 (0x5000151C)
#define GP_ADC_PARAM_DIF_REG_RESET           (0x00000000)
//register GP_ADC_PARAM_DIF_REG found for which all fields are reserved, omitting.



#define GP_ADC_PARAM_SE_REG                  (0x5000151E)
#define GP_ADC_PARAM_SE_REG_RESET            (0x00000000)
//register GP_ADC_PARAM_SE_REG found for which all fields are reserved, omitting.



#define SCAN_OBSERVE_REG                     (0x50003020)
#define SCAN_OBSERVE_REG_RESET               (0x00000000)

/*=============================*/
struct __SCAN_OBSERVE_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SCAN_FEEDBACK_MUX                 : 16;
};
#define SCAN_FEEDBACK_MUX                     (0xFFFF)



#define TEST_CTRL_REG                        (0x50003030)
#define TEST_CTRL_REG_RESET                  (0x00000000)

/*=============================*/
struct __TEST_CTRL_REG
/*=============================*/
{
    volatile uint16_t BITFLD_SHOW_CLOCKS                       : 1;
    volatile uint16_t BITFLD_SHOW_POWER                        : 1;
    volatile uint16_t BITFLD_SHOW_DCDC                         : 1;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_XTAL32M_CAP_TEST_EN               : 1;
    volatile uint16_t BITFLD_LDO_CORE_CAP_BYPASS               : 1;
    volatile uint16_t BITFLD_LDO_CORE_DUMMY_LOAD_ENABLE        : 1;
    volatile uint16_t                                          : 2;
    volatile uint16_t BITFLD_CP_CAP_BIAS_TRIM                  : 2;
    volatile uint16_t BITFLD_ADPLL_SCAN_TEST_EN                : 1;
    volatile uint16_t BITFLD_ADPLL_SCAN_COMP_EN                : 1;
};
#define SHOW_CLOCKS                           (0x0001)
#define SHOW_POWER                            (0x0002)
#define SHOW_DCDC                             (0x0004)
#define XTAL32M_CAP_TEST_EN                   (0x0010)
#define LDO_CORE_CAP_BYPASS                   (0x0020)
#define LDO_CORE_DUMMY_LOAD_ENABLE            (0x0040)
#define CP_CAP_BIAS_TRIM                      (0x0600)
#define ADPLL_SCAN_TEST_EN                    (0x0800)
#define ADPLL_SCAN_COMP_EN                    (0x1000)



#define TEST_CTRL2_REG                       (0x50003032)
#define TEST_CTRL2_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL2_REG
/*=============================*/
{
    volatile uint16_t BITFLD_ANA_TEST_OUT_SEL                  : 10;
    volatile uint16_t                                          : 1;
    volatile uint16_t BITFLD_ANA_TEST_OUT_TO_PIN               : 1;
    volatile uint16_t BITFLD_ANA_TEST_OUT_PARAM                : 4;
};
#define ANA_TEST_OUT_SEL                      (0x03FF)
#define ANA_TEST_OUT_TO_PIN                   (0x0800)
#define ANA_TEST_OUT_PARAM                    (0xF000)



#define TEST_CTRL3_REG                       (0x50003034)
#define TEST_CTRL3_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL3_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RF_TEST_OUT_SEL                   : 6;
    volatile uint16_t BITFLD_ENABLE_RFPT                       : 1;
    volatile uint16_t BITFLD_RF_TEST_OUT_PARAM                 : 6;
    volatile uint16_t BITFLD_RF_TEST_OUT_TO_PIN                : 1;
};
#define RF_TEST_OUT_SEL                       (0x003F)
#define ENABLE_RFPT                           (0x0040)
#define RF_TEST_OUT_PARAM                     (0x1F80)
#define RF_TEST_OUT_TO_PIN                    (0x2000)



#define TEST_CTRL4_REG                       (0x50003036)
#define TEST_CTRL4_REG_RESET                 (0x00000000)

/*=============================*/
struct __TEST_CTRL4_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RF_TEST_IN_SEL                    : 4;
    volatile uint16_t                                          : 4;
    volatile uint16_t BITFLD_RF_TEST_IN_PARAM                  : 5;
    volatile uint16_t BITFLD_RF_TEST_IN_TO_PIN                 : 1;
};
#define RF_TEST_IN_SEL                        (0x000F)
#define RF_TEST_IN_PARAM                      (0x1F00)
#define RF_TEST_IN_TO_PIN                     (0x2000)



