ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/include/da14531_es2.h
#define RFMON_ADDR                            (0xFFFC)



#define RFMON_LEN_REG                        (0x50003508)
#define RFMON_LEN_REG_RESET                  (0x00000000)

/*=============================*/
struct __RFMON_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFMON_LEN                         : 14;
};
#define RFMON_LEN                             (0x3FFF)



#define RFMON_STAT_REG                       (0x5000350C)
#define RFMON_STAT_REG_RESET                 (0x00000000)

/*=============================*/
struct __RFMON_STAT_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFMON_ACTIVE                      : 1;
    volatile uint16_t BITFLD_RFMON_OFLOW_STK                   : 1;
};
#define RFMON_ACTIVE                          (0x0001)
#define RFMON_OFLOW_STK                       (0x0002)



#define RFMON_CRV_ADDR_REG                   (0x50003510)
#define RFMON_CRV_ADDR_REG_RESET             (0x00000000)

/*=============================*/
struct __RFMON_CRV_ADDR_REG
/*=============================*/
{
    volatile uint16_t                                          : 2;
    volatile uint16_t BITFLD_RFMON_CRV_ADDR                    : 14;
};
#define RFMON_CRV_ADDR                        (0xFFFC)



#define RFMON_CRV_LEN_REG                    (0x50003514)
#define RFMON_CRV_LEN_REG_RESET              (0x00000000)

/*=============================*/
struct __RFMON_CRV_LEN_REG
/*=============================*/
{
    volatile uint16_t BITFLD_RFMON_CRV_LEN                     : 14;
};
#define RFMON_CRV_LEN                         (0x3FFF)



#define CLK_RTCDIV_REG                       (0x5000424C) /* Divisor for RTC 100Hz clock */
#define CLK_RTCDIV_REG_RESET                 (0x00051EA8)

/*=============================*/
struct __CLK_RTCDIV_REG
/*=============================*/
{
    volatile uint32_t BITFLD_RTC_DIV_FRAC                      : 10;
    volatile uint32_t BITFLD_RTC_DIV_INT                       : 9;
    volatile uint32_t BITFLD_RTC_DIV_DENOM                     : 1;
    volatile uint32_t BITFLD_RTC_DIV_ENABLE                    : 1;
    volatile uint32_t BITFLD_RTC_RESET_REQ                     : 1;
};
#define RTC_DIV_FRAC                          (0x03FF)
#define RTC_DIV_INT                           (0x7FC00)
#define RTC_DIV_DENOM                         (0x80000)
#define RTC_DIV_ENABLE                        (0x100000)
#define RTC_RESET_REQ                         (0x200000)
/*===========================================================================*/ 
/*===================== End of automatic generated code =====================*/ 
/*===========================================================================*/ 



/*===========================================================================*/ 
/*========================== Start of footer part ===========================*/ 
/*===========================================================================*/ 
/*----------------------------*/
/* Data access macros         */
/*----------------------------*/

#define SHIF16(a) ((a)&0x0001? 0:(a)&0x0002? 1:(a)&0x0004? 2:(a)&0x0008? 3: \
                   (a)&0x0010? 4:(a)&0x0020? 5:(a)&0x0040? 6:(a)&0x0080? 7: \
                   (a)&0x0100? 8:(a)&0x0200? 9:(a)&0x0400?10:(a)&0x0800?11: \
                   (a)&0x1000?12:(a)&0x2000?13:(a)&0x4000?14:           15)

#define SHIF32(a)((a)&0x00000001? 0:(a)&0x00000002? 1:(a)&0x00000004? 2:(a)&0x00000008? 3:\
                  (a)&0x00000010? 4:(a)&0x00000020? 5:(a)&0x00000040? 6:(a)&0x00000080? 7:\
                  (a)&0x00000100? 8:(a)&0x00000200? 9:(a)&0x00000400?10:(a)&0x00000800?11:\
                  (a)&0x00001000?12:(a)&0x00002000?13:(a)&0x00004000?14:(a)&0x00008000?15:\
                  (a)&0x00010000?16:(a)&0x00020000?17:(a)&0x00040000?18:(a)&0x00080000?19:\
                  (a)&0x00100000?20:(a)&0x00200000?21:(a)&0x00400000?22:(a)&0x00800000?23:\
                  (a)&0x01000000?24:(a)&0x02000000?25:(a)&0x04000000?26:(a)&0x08000000?27:\
                  (a)&0x10000000?28:(a)&0x20000000?29:(a)&0x40000000?30:               31)

#define SetWord8(a,d)  (* ( volatile uint8_t*) (a)=(d) )
#define SetWord16(a,d) (* ( volatile uint16_t*)(a)=(d) )
#define SetWord32(a,d) (* ( volatile uint32_t*)(a)=(d) )
#define SetWord64(a,d) (* ( volatile uint64_t*)(a)=(d) )

#define GetWord8(a)    (* ( volatile uint8_t*) (a) )
#define GetWord16(a)   (* ( volatile uint16_t*)(a) )
#define GetWord32(a)   (* ( volatile uint32_t*)(a) )
#define GetWord64(a)   (* ( volatile uint64_t*)(a) )

/* Aliases for backwards compatibility (only the Byte versions). */
#define SetByte(a,d) SetWord8((a),(d))
#define GetByte(a)   GetWord8((a))

#define SetBits16(a,f,d) ( SetWord16( (a), (GetWord16(a)&(~(uint16_t)(f))) | (((uint16_t)(d))<<SHIF16((f))) ))
#define SetBits32(a,f,d) ( SetWord32( (a), (GetWord32(a)&(~(uint32_t)(f))) | (((uint32_t)(d))<<SHIF32((f))) ))

// old-fashioned way. Allowed on APB-2 under the following conditions:
// * armcc is used (gcc for ARM seems to work as well?)
// * bitfields are marked with 'volatile' keyword and the correct word size
#define GetBits(a,f)    ( ((volatile struct __##a *)(a))->BITFLD_##f )
#define SetBits(a,f,d) (( ((volatile struct __##a *)(a))->BITFLD_##f )=(d) )

#define GetBits16(a,f) ( (GetWord16(a)&( (uint16_t)(f) )) >> SHIF16(f) )
#define GetBits32(a,f) ( (GetWord32(a)&( (uint32_t)(f) )) >> SHIF32(f) )

// Macro's used in the recommended_settings function
// All fields are combined into a single mask.
#define SetWordMasked16(a,m,d) SetWord16(a, (GetWord16(a)&~m) | (d&m))
#define SetWordMasked32(a,m,d) SetWord32(a, (GetWord32(a)&~m) | (d&m))


/*===========================================================================*/ 
/*=========================== End of footer part ============================*/ 
/*===========================================================================*/ 



// _DA14531_ES2_H_
#endif
